[
    "The discipline focuses on issues related to the holistic vision of automated design systems: types of support and development. The issues are presented in a consistent manner: the nature of the design process, the methodology for a systematic approach to design, the need to move to automated design. The design phases are presented in terms of a systematic approach to the design of complex systems. The basic construction principles and functions of the Automated Design Systems (AAD) are being reviewed. Study of the framework of the APR and its use in the design of technical and technological management tools and systems. Ownership: knowledge of automated design techniques and technologies for generic automated process management systems; ability to formulate design goals and objectives and reasonably select software tools for automated design; skills in the practical application of basic, including automated, design methods; and skills in the application of mathematical techniques that underpin the design process and the optimization of design solutions. To develop knowledge of and provide for modern APRs, skills in modern environments for automated design of systems and devices. Ownership: knowledge of modern software platforms and application packages used for automated design of systems and devices in various industries; ability to use standard and specialized software to design and perform the necessary calculations in the design process; skills in the use of modern technologies to address the management of technological equipment by example of events and controlled processes using SCADA systems. Development of the main stages of the design of the control devices by means of industrial automation systems. Ownership: knowledge of systems design principles and methods, basic support for automated design processes; skills in designing design documents for the design device; skills in the design of functional units of automatic control systems based on the APR, which include: development of an electrical basic scheme; computer execution of a printed circuit drawing, drawing of the device &apos; s shell. No. 1 The Moodle Reference Work.  In the follow-up work, there will be a number of theoretical questions that need to be answered correctly. There are also a number of interactive issues. For example: - Basic features of the design of printed circuit boards. What features should be taken into account in the design of printed boards?  - Show the elements using the marker. It is necessary to move the marker (point) to which the name is attached to the appropriate el part of the diagram. Note the following elements in the diagram: - Transformer, - Operational Idler (OP), - Transistor - What is CAE? I. Introduction. General provisions and objectives of automated design. Automated design objects. Main steps in computing design. Automated Design Systems (ASPR). Project objectives. Project procedures. Combined automated design algorithm. Topic 1. Automated design processes. Model solutions in the field of electrical engineering. General description and specifications of the SAPR. Classification of SAPR. Integrated SAPR (CAD/CAM/CAE). The general architecture of modern SPR electrical facilities. Altium Designer, printed circuit boards and PLIS. AutoCAD Electric. A three-dimensional design package called \"Creo Parametric\". Systems for automating scientific research. Subsystem components of the SAPR (methodological, linguistic, mathematical, software, technical, information, organizational support). Main tasks of technological (functional) design and design (technical) design of management tools and systems. Topic 2. Technical support. Purpose and general description of the technical support. Data-processing software. Data production and input tools. Data display and documentation tools. The tools of the project decisions archive. Data transmission tools. Technical equipment packages. Topic 3. Math support. Purpose and general description of mathematical support. The hierarchy of mathematical models is the basis for a flea-hierarchic approach to the design of management tools and systems. Methodology for obtaining mathematical models at different hierarchical levels. Types of mathematical models. A morphological description of the objects of design. Structural and geometric models. Functional description of design objects. Classification and main types of functional models. Methods of project decision-making. Synthetic algorithms for project decisions. Topic 4. Software. Designation and general description of the SAD software. Operating systems. Computer network software. Programming systems. General purpose packages. Special software for the APR. SAP application packages. Expert systems in design. Interactive graphics systems. Machine graphics software packages. Specific features of the SAPR machine graphics. Dialogue systems for the collective use of the APR. Automation of the design of SCADA-based process management systems. Cloud services: SAPR as a Service technology. Topic 5. Information management. Materiality and integral parts of the information management of the APR as an integral part of modern information technology. Principles for the construction of databases and data banks and ways to harmonize programmes in the development of the database. Reference, network and hierarchical database models. Data security and integrity. Topic 6. Language support. Appointment and general description of language arrangements. Language managers. Basic language services. Language processors. Topic 7. Methodological and organizational support. Purpose and general description of methodological support. Composition of methodological support: general description, operating instructions, language description, description of design procedures. Designation and general description of organizational support. Conclusion. Analysis of the impact of engineering automation on the quality of design products. Trends in the further development of computer design tools in the instrument building. Analysis of the demand of SPR specialists in the labour market in the north-west region. ",
    "The discipline examines the methods, tools and technologies for the automated design of complex mechanized modules and robots, the stages and stages of the product life cycle, the design and design, the role and location of automated design systems (AADs). The discipline provides basic methods and tools for the design and text documentation of the electrical engineering project, using dedicated SAPs. It deals with the exchange of information in automated design using different SAPRs. As part of the discipline, the template is reviewed and design documentation is being developed for examples of mechanical modules and robots performed according to the standard. The practical exercises and laboratory work are aimed at the development of specialized SPR electrical design tools using examples of mechanized modules and robots. Knowledge of the basic concepts of the SAPR for the design of parts of mechanical modules and robots as a tool for describing products during their life cycle. Develop automated geometric modelling skills in the SAPR, an understanding of the basic principles for the design and construction of the parts of the mechanized modules and robots. Knowledge of the basic concepts of the schematic part of the design and development of the parts of the mechatron modules and robots, and of the skills to place the elements of the diagram in the electrical assembly panels (couples). Objective: To make independent and in-depth use of electrical SPR functionality in the design of electrical devices based on laboratory and hands-on skills. The content of the task: the basic data are: a brief description of the devices to be designed, their basic basic layouts (images), information from the manufacturers of equipment and constructions (cools, remotes). The result is project documentation: diagrams of electrical principle, connections, list of elements, table of connections. The report should also highlight the main steps in the development of the project documents through the APR. The theme of the individual task is \"Development of an electric control system element in the AutoCAD Electric system\". The \"Design of development management system of the actor in CAD AutoCAD Electric\". The procedure for the issuance, execution and evaluation of individual household tasks is determined by the method of ongoing monitoring. Examples of issues to the differentiated set-off of geometric modelling technology in the AutoCAD SAPR. Coordinate systems and how to enter the coordinates of the points. Planes of construction. Dependency, dimensionation, reference dimensions. Sloppy architecture, types of lines, scope, systemic properties of geometric objects. Ways of creating and editing flat volume models. Primitives, composite objects, blocks and groups. Ways of creating and using libraries. External links, composite documents and OLE technology in object modelling. General characteristics of AutoCAD Electric. Design stages and composition of automation projects. Types and types of diagrams, general rules for the execution of electrical documents. The concept of ESCA standards. Structural and functional measurement and automation schemes. Designation of functional schemes, methodology and general principles for their implementation. Image of technological equipment and communications. Image of measurement and automation equipment. Positioning symbols of automation equipment. Design requirements and examples of functional schemes. Basic electrical circuits. General requirements. Rules for the implementation of schemes. Graphic symbols of diagram elements. The symbols of the chains and the wires. The alphanumeric symbols of the diagram elements and their deciphering. Choice of security and switching devices. Purpose and general requirements. Selection of voltage and power supply requirements. Selection of electrical power, reservation and automatic inclusion of the reserve. Power supply control and protection equipment. Choice of control and protection devices. Positions for the installation of control and protection devices. The selection of wire sections and the use of cables. External connections and connections. General provisions. External connections. External wiring connections. Tables of external wiring connections. External wiring connections. AutoCAD Electronic Interface. Project documents. Document and project properties. Document logs. Graphic menu master. Agreement on the names of blocks of graphical images. Attributes of blocks of graphical images. Adding an attribute. Edit the attribute, display properties. Redistribution of attribute. Set up a graphical image library. Graphic image editor. Procedure for the establishment and editing of CBOs in accordance with ECDC. Attributes of the UHO. Parental and subsidiary components. Creation and adaptation of a user library of graphic images. == sync, corrected by elderman == @elder_man The names of the catalogue database tables. Catalog tables fields. Box of the diagram component from the catalogue. Update the components from the catalogue database. Edit the catalogue database. The concept of wire, chains, cables, wires. The use of chains. Chain designer. Wire tools. Wire numbering. Wire checks. It's a layered wire architecture. Creation, editing. Boxing of terminals and connectors. Clemma properties. Clemmus pad editor. Connecting points, couplings, multi-level terminals. The concept of PLC. Review of the PLC database file. Formation and insertion of PLC modules. Entry/output points. Adding the PLC module to the database. Filling out the main inscription. Box of electrical circuit components from the graphic menu. Construction of lines of communication (conducts). Creating layers of wires. Organization of AutoCAD Electronic documents. Cross-references. Project tools (updating components, wires, tracking changes). General information about the layouts. Relationship between the drawing of the diagram and the layout of the panel. Create a composite image, edit it. Positions and position numbers. Combination points of the composite image. Tools for working with boxes and DIN-reaks. Illustrative questions for Colloquium 1 What geometric models are used in design? Give me the concept of \"geometric models\". The basic concepts and terminology of the APR are two-dimensional design. Electrical engineering automation systems. Please describe the classification of electrical engineering automation systems. Structural and functional electrical circuits. Give me a definition of structural electrical circuits. Give me a definition of electrical connections. Basic electrical circuits. Rules for the discharge of basic electrical circuits.   Illustrative questions for Colloquium 2 Specification of the basic electrical circuit. The main electrical circuits of the external connections and connections create an electrical project in the AutoCAD Electric Environment to create graphic images (components) in AutoCAD Electrical Adaptation of the AutoCAD Electronic Graphics Library. AutoCAD Electric Cepie Catalogues and AutoCAD Electrical Clemma Wirings at AutoCAD Electric PLC at AutoCAD Electric Electrical Policy and Interconnector Schemes, AutoCAD Electrical Setup of AutoCAD Electrical Schematic Schematic Reports at AutoCAD Electric Spectrum Issues for Testing the Residual Knowledge of AutoCAD Geometric Modelling Technology at AutoCAD. Coordinate systems and how to enter the coordinates of the points. Planes of construction. Ways of creating and editing flat volume models.  Ways of creating and using libraries. External links, composite documents and OLE technology in object modelling. General characteristics of AutoCAD Electric. Design stages and composition of automation projects. Types and types of diagrams, general rules for the execution of electrical documents. The concept of ESCA standards. Structural and functional measurement and automation schemes.  Image of technological equipment and communications. Image of measurement and automation equipment. Positioning symbols of automation equipment. Design requirements and examples of functional schemes. Basic electrical circuits. Rules for the implementation of schemes.  Choice of security and switching devices. Purpose and general requirements. Selection of voltage and power supply requirements. Selection of electrical power, reservation and automatic inclusion of the reserve. External connections and connections. General provisions.  AutoCAD Electronic Interface. Project documents. Document and project properties. Document logs. Graphic menu master. Agreement on the names of blocks of graphical images. Attributes of blocks of graphical images.  Set up a graphical image library. Graphic image editor. Procedure for the establishment and editing of CBOs in accordance with ECDC. Attributes of the UHO.  The concept of wire, chains, cables, wires.  Creation, editing.  The concept of PLC. Review of the PLC database file. Formation and insertion of PLC modules.  Filling out the main inscription. Box of electrical circuit components from the graphic menu.  Organization of AutoCAD Electronic documents. Cross-references. Project tools (updating components, wires, tracking changes). I. Introduction. Subject subject of discipline, its tasks and liaison with other baccalaureate courses in course 15.03.06. Life cycle of products, stages, stages and design methods. Demonstration of current trends in automated design. Topic 1. Geometric models. AutoCAD Geometric Modelling Technology. Coordinate systems and how to enter the coordinates of the points. Planes of construction. Topic 2. The basic concepts and terminology of the APR are two-dimensional design. Dependency, dimensionation, reference dimensions. Sloppy architecture, types of lines, scope, systemic properties of geometric objects. Ways of creating and editing flat volume models. Primitives, composite objects, blocks and groups. Ways of creating and using libraries. External links, composite documents and OLE technology in object modelling. Topic 3. Electrical engineering automation systems. General characteristics of AutoCAD Electric. Design stages and composition of automation projects. Types and types of diagrams, general rules for the execution of electrical documents. The concept of ESCA standards. Topic 4. Structural and functional electrical circuits. Structural and functional measurement and automation schemes. Designation of functional schemes, methodology and general principles for their implementation. Image of technological equipment and communications. Image of measurement and automation equipment. Positioning symbols of automation equipment. Design requirements and examples of functional schemes. Topic 5. Basic electrical circuits. General requirements. Rules for the implementation of schemes. Graphic symbols of diagram elements. The symbols of the chains and the wires. The alphanumeric symbols of the diagram elements and their deciphering. Topic 6. Basic electrical circuitry. Choice of security and switching devices. Purpose and general requirements. Selection of voltage and power supply requirements. Selection of electrical power, reservation and automatic inclusion of the reserve. Power supply control and protection equipment. Choice of control and protection devices. Positions for the installation of control and protection devices. The selection of wire sections and the use of cables. Topic 7. External connections and connections. General provisions. External connections. External wiring connections. Tables of external wiring connections. External wiring connections. Topic 8. Creation of an electrical project in the AutoCAD Electric environment. AutoCAD Electronic Interface. Project documents. Document and project properties. Document logs. Topic 9. Create graphical images (components) in AutoCAD Electronic. Graphic menu master. Agreement on the names of blocks of graphical images. Attributes of blocks of graphical images. Adding an attribute. Edit the attribute, display properties. Redistribution of attribute. Set up a graphical image library. Graphic image editor. Procedure for the establishment and editing of CBOs in accordance with ECDC. Attributes of the UHO. Parental and subsidiary components. Topic 10. Adaptation of AutoCAD Electronic Graphics Library. AutoCAD Electronic Catalogues. Creation and adaptation of a user library of graphic images. == sync, corrected by elderman == @elder_man The names of the catalogue database tables. Catalog tables fields. Box of the diagram component from the catalogue. Update the components from the catalogue database. Edit the catalogue database. Topic 11. Networks and wires at AutoCAD Electric. The concept of wire, chains, cables, wires. The use of chains. Chain designer. Wire tools. Wire numbering. Wire checks. It's a layered wire architecture. Topic 12. Clemms at AutoCAD Electric. Creation, editing. Boxing of terminals and connectors. Clemma properties. Clemmus pad editor. Connecting points, couplings, multi-level terminals. Topic 13. PLC in AutoCAD Electric. The concept of PLC. Review of the PLC database file. Formation and insertion of PLC modules. Entry/output points. Adding the PLC module to the database. Topic 14. Electrical mainframes and connections of AutoCAD Electrical, AutoCAD Electrical documents. Filling out the main inscription. Box of electrical circuit components from the graphic menu. Construction of lines of communication (conducts). Creating layers of wires. Organization of AutoCAD Electronic documents. Cross-references. Project tools (updating components, wires, tracking changes). Topic 15. Combination of the installation panel at AutoCAD Electronic. General information about the layouts. Relationship between the drawing of the diagram and the layout of the panel. Create a composite image, edit it. Positions and position numbers. Combination points of the composite image. Tools for working with boxes and DIN-reaks. Conclusion. Schematic reports in AutoCAD Electric. The notion of AutoCAD Electronic reports. Preparation of reports on diagrams and installation panels. Import and export of data from the electronic table. Add user reporting fields. Trends and prospects for the automation of design. Role and place of information technology in automation",
    "The discipline examines mathematical methods for analysing the stability of dynamic systems: the first method of Liapunov, the method of functions of Liapunov, the methods of analysing the stability of linear systems, which were not studied in the basic course of automatic control theory. Methods for synthesizing dynamic object management laws using the stability theory, in particular the speed gradient algorithm, are being considered. There are basic concepts and results on the sustainability, roughness and platitude of uncertain systems. Sustainability of dynamic systems. Basic knowledge on the mathematical theory of sustainability and the application of its methods is being acquired. Basic knowledge is being developed in the field of mathematical methods for the study of the stability of motion and the equilibrium of linear and non-linear automatic management systems, as well as in the synthesis of governance laws based on the theory of sustainability. The ability and skills to analyse stability using the first and second Lapunov methods, the speed gradient algorithm, the Harriton techniques, and the linear stability analysis techniques. Questions for the first monitoring exercise under the OMTA Theoretical Issues 1. Linearization of the function of multiple variables (detailed justification). 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Linearization of equations in the form of variable state (detailed justification). 3. Balance state (definition, method of finding). 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Stability on Lapunov and asymptotic stability (definitions). 5. I'm not sure what I'm talking about. Mikhaylov's stability criterion (formulation, graphic illustration, including stability boundary). 6. All right, all right, all right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. The first method is Lapunov (theorem).   Tasks 1. Linearize the specified non-linear function of several variables in the vicinity of a given point. 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Identify c.o.s. 1 and 2 and draw a conclusion on the type of matrix R (p.o.,.o., etc.). 3. For square shape Q (x1, x 2) =. = xT Rx write down the matrix R and define its type using the Sylvester criterion.   The test work is designed for two academic hours. Each student will be provided with an individual set of theoretical questions and tasks from the above lists.   1. If the equations of the non-liner system are linearized, the \"workpoint\" is: (a) the point of steady state (b) the initial state of the system and) any state of the system 2. The linearized equation is different from the original non-liner equation because it is. (a) simpler (b) more accurate (c) near 3. The matrix exponent is defined as (a) a segment of a row of degrees (b) an endless row of degrees (c) of trigonometric row 4. What equation is satisfied by the matrix exponent? (a) the reference differential equation (b) of the Lappun equation (c) of the characteristic equation 5. How many polynomies must be tested for stability in the first theorem of Haritonov? (a) n (b) 2 to the degree of n (c) 2 to the degree of n+1 6. How many polynomies must be tested for stability in the second theorem of Haritonov? (a) 4 (b) 2 (c) n 9. The first method of Lapunov deals with (a) sustainability in small (b) with sustainability in general (c) with stability in large 10. The adaptive system usually takes as a reference model. (a) A model of a control object with nominal parameters (b) an arbitrary dynamic system with desired dynamics (c) a system with better dynamics than the control object. Topic 1. Features of non-linear systems. Mathematical models of dynamic systems. Types of mathematical models of dynamic systems. Non-linear systems. Static and dynamic non-linear links. Equations of non-linear systems. Description of non-linear systems in state space. Topic 2. Linearization of non-linear mathematical models. Linearization of the non-linear static characteristic – a function of one variable – by degradation in Taylor's row. Linearization of the function of several variables. Linearization of equations in the form of variable state. Practical methods of linearization. Topic 3. Quadratic shapes. Marked (positive and negative) and permanent (positively semi-defined and negative) square shapes and corresponding matrices. Indeterminate quadratic shapes. Sylvester's criterion. The relationship between the matrix type and its own values. The functions of the Liapunov. Topic 4. The solution to the status matrix equation. The equilibrium of the dynamic system. Transition matrix. A matrix exhibitor and how to define it. Koshi's formula. A state of balance. Methods of balancing. Topic 5. Sustainability of equilibrium states and decisions of differential equations. Sustainability of the equilibrium state. Sustainability on Lapunov and asymptotic sustainability (\"in small\" and \"in general\"). Sustainability of differential equation solutions. Lapunov's first method. Topic 6. Some methods for analysing the stability of linear systems. Sustainability criteria for Raus, Lienara-Shipara, Mikhaylov, Lipatova-Sokolov. Topic 7. Lapunov's second method. The functions of the Liapunov. Method of functions of the Liapunov in the analysis and synthesis of non-linear systems. Theorems of Lapunov, Krasovsky and Barbashin Krasovsky on sustainability and asymptotic sustainability. Theorems of Lapunov and Chetaev about the volatility of traffic. The Lapunov equation. Topic 8. Methods of building the functions of the Liapunov. Method of undefined coefficients. The functions of Liapunov are \"quadratic shape plus integral from non-linearity\". Topic 9. Application of sustainability theory techniques in the synthesis of adaptive systems. Some of the results of the matrix algebra. Equation of an adaptive system with a reference model (ASEM). Synthesis of the parameter adaptation algorithm in the ASEM using the second Lapunov method. Equations and structure of the ASEM. Topic 10. Speed gradient algorithm. The speed gradient algorithm and its application to the synthesis of the adaptive system. Topic 11. Management of uncertain systems. Undefined objects and systems. Brutalness and ferocity. The task of adaptive management. Interactive systems. Hariton's Theorems.",
    "The best management theory includes a presentation of methodological tools for practical solutions to optimization search challenges, synthesis of optimal regulators for linear and non-linear automatic systems. The discipline study addresses issues related to the objective of optimization, the choice of the best value for money criterion, and the main decision-making methods in an uncertain environment. The algorithms for generic optimization tasks, the basic methods for synthesizing optimal management laws for linear systems, are being considered. I. Studying key methods and learning about algorithms for generic optimization objectives. Develop search optimization and analytical design skills for optimal management systems. Development of knowledge and practical skills in MATLAB applications packages. 1.       Search for an extreme if there are unconnected optimization areas. 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Single-dimensional search methods. 3.       Gradient optimization techniques. 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       A consistent symlex method with a constant step. 5. I'm not sure what I'm talking about.       A consistent symlex method with a constant step. 6. All right, all right, all right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       A consistent symlex method with a variable step. 7.       Nelder-Mid method. 8. I'm sorry, I'm sorry. I'm sorry.       Methods of finding an extremist in multi-extreme tasks. 9.       The method of sliding clearance. 10.  Expert assessment methods. The rank method. 1.       Determination of the optimal control effect against the control economy criterion for the control facility set by the Kosha equation system. An example. 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Determination of the optimum control effect using the control economy criterion for the control facility given by the 2nd order differential equation. An example. 3.       Determination of the optimum manager &apos; s impact against the management economy criterion for the control facility set by the structural chart. An example. 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Determination of the optimum control for the integrated quadratic criterion for the control facility set by the Kosha-shaped equation system. An example. 5. I'm not sure what I'm talking about.       Determination of the optimum control for the integrated quadratic criterion for the control object given by the 2nd order differential equation. An example. I. Introduction. Aims and purposes of discipline. Relationship to other disciplines. A review of literature on discipline. Topic 1. Main challenges in building optimal systems. Historical background and examples of classical optimization challenges. Current state of operations theory. Brief overview of optimization objectives and classification of methods to address them. Specification of optimization tasks in the research, design and operation phases of technical systems. Topic 2. Mathematical formulation of the optimization task. Select optimised parameters. Formation of the best value for money criterion. Vector and generalized criteria. Extreme, necessary and sufficient conditions for its existence. It's a convex function. Utility. Normalization of indicators and parameters. A conditional and unconditional extreme. Topic 3. Multi-step methods to search for the extreme function of one variable. Passive and proactive strategies to reduce uncertainty. Comparative analysis of methods for breaking the uncertainty interval. Methods of gold section and dichotomy. Topic 4. Search for an extreme function of several variables. Qualitative and unconditional optimization techniques. Gradient methods, Newton techniques, symlex methods. Lagrangian multiplier method. It's random search techniques. Methods of dealing with multi-extreme and mixed challenges. Topic 5. Methods of dealing with optimization in the context of incomplete a priori information. Choice of the preferred solution. Probable, minimal, balanced decision-making. Select the optimal values of the control parameters. Topic 6. Vector optimization. Problem statement. Main indicator method. Flexible priority methods. Methods for determining weight multipliers. Select the optimal values of the control parameters. Topic 7. Optimal management systems. Statement of the challenge of good governance. Optimization criteria. Functional, extremist, necessary and adequate conditions. The principle of optimum performance of R. Bellman. Dynamic programming method. Synthesis of optimal systems based on variable calculation. Lagrangian method. Best value for money. Optimal management of continuous systems. The principle of maximum L.S. Pontragyn. The basic theorem of the principle of maximum. Synthesis of systems of optimum speed. Optimal linear system. Status regulator. Relationship between variable calculation, maximum principle and dynamic programming. Conclusion. Trends in discipline. The characterization of residual knowledge in discipline. Examples of practical discipline tasks. ",
    " Discipline includes a statement of the basic theory and management of manipulative robots. Basic information on the dynamics of manipulation mechanisms, mathematical traffic models and their analysis are being considered. The methods and algorithms for the kinematic control of manipulators are discussed in detail. The discipline is supported by a large number of practical and laboratory activities, as well as by the self-employment of students in the main areas of the programme. Studying the basics of the theory and management of manipulative robots. Ownership: knowledge of basic kinematic relationships; ability to formulate direct and reverse position tasks and direct and feedback tasks on the speed of manipulator links; skills in building manipulator control algorithms. To develop a common understanding of the dynamics of manipulation mechanisms, mathematical traffic models and their analysis. Ownership: knowledge of the dynamic properties of the manipulator; ability to compile the force computation algorithm and the response points of the manipulator; skills to draw differential manipulator movement equations relative to generic coordinates. Training in practical methods of research and calculation of the executive system of the manoeuvring robot. Ownership: knowledge of the means of automated synthesis of mechanical systems; skills in the development of management systems for mechanized and robotic technology complexes; and skills in the modelling of mechatron and robotic technology complexes. Illustrative questions for the colloquium: 1. Write down the equation for the static equilibrium of a three-point manipulator containing only progressive kinematic pairs of 2. Write down the equation for the static equilibrium of a three-point manipulator containing only progressive rotations 3. Write the static equilibrium equation for the PUMA-560 six-point manipulator, which has the first three pairs of rotations, and the next three are progressive. 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Write the ratio between the reaction force and the response of the manipulator's three-rotation pair. 5. I'm not sure what I'm talking about. Explain why in order to calculate the forces and moments operating at the manipulator &apos; s links it is appropriate to use a reverse recursion method. 6. All right, all right, all right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay. Compute an algorithm to calculate the forces and the reaction points of a manipulator having a flat three-line structure with rotating pairs, if generic coordinates are specified. 7. Compute an algorithm to compute the ellipses of developing forces for a flat two-blind manipulator. 8. I'm sorry, I'm sorry. I'm sorry. Explain what practical tasks the ellipsoids of manipulator-developed forces can be used for. 9. What are the main axes of the force ellipsoid — their size or direction? 10. Formulate the first and second challenge of the dynamics for the manipulation mechanism. I. Introduction. The subject of discipline and its tasks. The structure and content of the discipline and its relationship to other subjects of the curriculum. Topic 1. Basic kinematic relationships. Manipulator's like a mechanical system. Coordinate conversions, homogeneous coordinates and transformations. Positioning and orientation of manipulator links, special reference systems. Topic 2. Manipulator position in the operating space. Direct and reverse positional tasks. Geometry of the manipulator's operating space. Topic 3. Speed and acceleration of the manipulator's cords. Steady body rotation. Speed and acceleration of the manipulator's cords. Direct and reverse speed challenge. Kinematic properties of manipulators. Topic 4. Kinematic manipulator control. Planning the trajectory in the co-ordinates space. Manipulator control in the coordinates of the contraction. Topic 5. Equation of manipulative kinetics. Static of manipulation mechanisms. Workforce and moment analysis. Dynamic properties of the manipulator. Topic 6. Executive-level management system. Mathematical model of the executive system, study of the linearized model. Automated synthesis of the executive system. Topic 7. Dynamic manipulator control methods. Methods based on the reverse of the dynamics. Control decomposition, force feedback and dynamic planning. Topic 8. Logical control of a complex robotic system. The concept of a complex system, the construction of subsystem models, a network machine, a network of machines. Method of managing a complex robotic system. Conclusion. Prospects for the development of mechatron and robotic systems.",
    "The best management theory includes a presentation of methodological tools for practical solutions to optimization search challenges, synthesis of optimal regulators for linear and non-linear automatic systems. The discipline study addresses issues related to the objective of optimization, the choice of the best value for money criterion, and the main decision-making methods in an uncertain environment. The algorithms for generic optimization tasks, the basic methods for synthesizing optimal management laws for linear systems, are being considered. I. Studying key methods and learning about algorithms for generic optimization objectives. Develop search optimization and analytical design skills for optimal management systems. Development of knowledge and practical skills in MATLAB applications packages. 1.       Search for an extreme if there are unconnected optimization areas. 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Single-dimensional search methods. 3.       Gradient optimization techniques. 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       A consistent symlex method with a constant step. 5. I'm not sure what I'm talking about.       A consistent symlex method with a constant step. 6. All right, all right, all right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       A consistent symlex method with a variable step. 7.       Nelder-Mid method. 8. I'm sorry, I'm sorry. I'm sorry.       Methods of finding an extremist in multi-extreme tasks. 9.       The method of sliding clearance. 10.  Expert assessment methods. The rank method. 1.       Determination of the optimal control effect against the control economy criterion for the control facility set by the Kosha equation system. An example. 2. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Determination of the optimum control effect using the control economy criterion for the control facility given by the 2nd order differential equation. An example. 3.       Determination of the optimum manager &apos; s impact against the management economy criterion for the control facility set by the structural chart. An example. 4. All right, all right, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay, okay.       Determination of the optimum control for the integrated quadratic criterion for the control facility set by the Kosha-shaped equation system. An example. 5. I'm not sure what I'm talking about.       Determination of the optimum control for the integrated quadratic criterion for the control object given by the 2nd order differential equation. An example. I. Introduction. Aims and purposes of discipline. Relationship to other disciplines. A review of literature on discipline. Topic 1. Main challenges in building optimal systems. Historical background and examples of classical optimization challenges. Current state of operations theory. Brief overview of optimization objectives and classification of methods to address them. Specification of optimization tasks in the research, design and operation phases of technical systems. Topic 2. Mathematical formulation of the optimization task. Select optimised parameters. Formation of the best value for money criterion. Vector and generalized criteria. Extreme, necessary and sufficient conditions for its existence. It's a convex function. Utility. Normalization of indicators and parameters. A conditional and unconditional extreme. Topic 3. Multi-step methods to search for the extreme function of one variable. Passive and proactive strategies to reduce uncertainty. Comparative analysis of methods for breaking the uncertainty interval. Methods of gold section and dichotomy. Topic 4. Search for an extreme function of several variables. Qualitative and unconditional optimization techniques. Gradient methods, Newton techniques, symlex methods. Lagrangian multiplier method. It's random search techniques. Methods of dealing with multi-extreme and mixed challenges. Topic 5. Methods of dealing with optimization in the context of incomplete a priori information. Choice of the preferred solution. Probable, minimal, balanced decision-making. Select the optimal values of the control parameters. Topic 6. Vector optimization. Problem statement. Main indicator method. Flexible priority methods. Methods for determining weight multipliers. Select the optimal values of the control parameters. Topic 7. Optimal management systems. Statement of the challenge of good governance. Optimization criteria. Functional, extremist, necessary and adequate conditions. The principle of optimum performance of R. Bellman. Dynamic programming method. Synthesis of optimal systems based on variable calculation. Lagrangian method. Best value for money. Optimal management of continuous systems. The principle of maximum L.S. Pontragyn. The basic theorem of the principle of maximum. Synthesis of systems of optimum speed. Optimal linear system. Status regulator. Relationship between variable calculation, maximum principle and dynamic programming. Conclusion. Trends in discipline. The characterization of residual knowledge in discipline. Examples of practical discipline tasks. ",
    "Production practices are the main stage of practical learning that consolidates the theoretical knowledge and practical skills acquired in previous stages of learning, which form the basic skills and skills. Study of the modern structure of the enterprise and production; principles of operation of selected parts of the management systems; process of manufacturing parts and components of automatic control systems; study of software products needed for the calculation and analysis of design solutions, design of design documents. Ownership: knowledge of the structure of an enterprise or organization, the functions of its units, their relationship and subordination; knowledge of the stages of the process of manufacturing individual elements and components of information and energy electronics devices; skills in collecting and analysing baseline data for the calculation and design of management systems, schemes and devices of different functional purposes; skills in the preparation of requests for spare parts and consumables, as well as for the verification and calibration of equipment; skills in the organization of metrological support for the production of materials and products of management systems; skills in organizing the work of small teams of performers; skills in the collection, processing, analysis and systematization of domestic and foreign scientific and technical information on management systems research; skills in production activities. Develop customization, assembly and testing skills for automatic control systems, as well as the ability to document, present and report the results of the work performed. Ownership: knowledge of current developments in information technology in management systems and automated production management systems; skills in the technological preparation of production of materials and products of management systems; skills in the design, testing, testing, testing of the performance of measuring, diagnostic and technological equipment used for various scientific, technological and production tasks in management systems; skills in the maintenance, preventive inspection and maintenance of measuring, diagnostic, technological equipment; skills in the analysis and systematization of research results; and skills in the presentation of material in the form of scientific reports, publications, presentations. Develop and fine-tune the software products needed to calculate and analyse design solutions, design design design documents; develop software products to manage the process in automated production management systems. Ownership: knowledge of the stages of the development of knowledge-based products; knowledge of the basic requirements of information security at work; skills in developing instructions for the operation of the technical equipment and software used for service personnel; skills in the calculation and design of electronic devices, circuits and devices for various functional purposes in accordance with the design engineering specification.",
    "Learning practices are the initial stage of practical learning that consolidates the theoretical knowledge and practical skills acquired in the previous stages of learning, which form the basic skills and skills. Study of information technologies used in the training process, knowledge of the electronic library system as a source of individual access to the collections of teaching and scientific literature, reference and bibliographic publications and specialized periodicals. Development of computer skills, presentation of work done, team skills. Development of information technology techniques and skills in the execution and editing of images and drawings by modern means.",
    "The discipline deals with the types of robotic software management devices, the basic principles for their construction, their features and characteristics, the characteristics of operating systems and the basic principles of programming of industrial robots with numerical software management (PPS). The acquired knowledge will be directly used by students in practical activities. Knowledge of the main characteristics of the electric power control systems of industrial robots and aggregates; classification of CPU devices according to technological, functional and structural characteristics; basic principles for the programming of electric power transmission systems of industrial robots and CPU units. To develop the ability to apply different methods for the programming of electric power systems of industrial robots with CPUs; to analyse systems and devices with CPUs when they are selected for design and technology purposes; and to use different programming languages for electric power systems of industrial robots with CPUs. To develop skills for programme managers in low- and high-level languages, to work with modern integrated software development environments for CPUs, and to design electric power systems for industrial robots with CPUs. Illustrative issues to differentiated set-off Current status of CPU systems. Basic concepts and definitions. Classification of software management systems for industrial robots.  Characteristics and design features of numerical control systems: Positional, contour and combined CPU systems.  CPU systems with a permanent structure and a system with a software application of work algorithms. Characteristics and design features of NC numerical systems.  Characteristics and design features of CNC numerical systems. Characteristics and design features of other numerical systems. Software objectives and composition. Characteristics of operating systems.  Algorithms and programs of power control functions of industrial robot systems with CPU. Software objectives and composition. Characteristics of operating systems.  Algorithms and programs of industrial robot management with CPU. General software issues of the HUD.  Software development phases. Main software products for industrial robot management with CPU.  Overall design of CPU software packages. Programming methods.  Algorithmic design of programmes for industrial machines and units with CPUs. Means of monitoring and diagnostics of industrial robot management systems with CPU. Principles for the programming of industrial robots with CPUs.  Methods and tools for programming industrial robots with CPUs.  Coding of information and process programming languages.  Automation systems for programming industrial robots with CPUs. Prospects for the development of CPU systems. Case studies for the colloquium Current status of CPU systems. Classification of software management systems for industrial robots. Characteristics and design features of numerical control systems: Positional, contour and combined CPU systems. CPU systems with a permanent structure of the System with software implementation of work algorithms.  Characteristics and design features of NC numerical systems. Characteristics and design features of CNC numerical systems.  Software objectives and composition.  Characteristics of operating systems. Algorithms and programs of power control functions of industrial robot systems with CPU. Software objectives and composition.  Characteristics of operating systems. Algorithms and programs of industrial robot management with CPU. General software issues of the HUD. Software development phases.  Main software products for industrial robot management with CPU. Overall design of CPU software packages.  Algorithmic design of programmes for industrial machines and units with CPUs.  Means of monitoring and diagnostics of industrial robot management systems with CPU. Principles for the programming of industrial robots with CPUs. Methods and tools for programming industrial robots with CPUs. Coding of information and process programming languages. Automation systems for programming industrial robots with CPUs. Prospects for the development of CPU systems. I. Introduction. Aims and purposes of discipline. Current status of CPU systems. Topic 1. Electrical power train systems control systems of industrial robots and units with CPUs. Basic concepts and definitions. Classification of software management systems for industrial robots. Characteristics and design features of numerical control systems: Positional, contour and combined CPU systems. CPU systems with a permanent structure and a system with a software application of work algorithms. Characteristics and design features of NC numerical systems. Characteristics and design features of CNC numerical systems. Characteristics and design features of other numerical systems. Topic 2. CPU robot software. Software objectives and composition. Characteristics of operating systems. Algorithms and programs of power control functions of industrial robot systems with CPU. Software objectives and composition. Characteristics of operating systems. Algorithms and programs of industrial robot management with CPU. General software issues of the HUD. Software development phases. Main software products for industrial robot management with CPU. Overall design of CPU software packages. Programming methods. Algorithmic design of programmes for industrial machines and units with CPUs. Means of monitoring and diagnostics of industrial robot management systems with CPU. Topic 3. Principles for the programming of industrial robots with CPUs. Methods and tools for programming industrial robots with CPUs. Coding of information and process programming languages. Automation systems for programming industrial robots with CPUs. Conclusion. Prospects for the development of CPU systems.",
    "The theoretical and applied issues covered are useful for students specializing in management and information technology in technical systems, computer and mathematical modelling. It provides a framework for Data Science, which includes data collection, storage and production (identifying anomalies in raw data, cleaning up noise, supplementing data, filling (deleting) missing values), classification and clustering, search for association rules, interpolation, extraction and approximation, correlation and regression analysis, artificial intelligence and machine learning, neural networks, clean neural networks. In addition, the current computing base is being reviewed in the context of the challenges of Data Science (CUDA, GPU, FPGA, SoC). Attention is given to practical tasks using modern software tools (MATLAB, Python, R, GPU). The purpose of the discipline is to study mathematical models, methods and algorithms for the analysis of data and artificial intelligence and to acquire the skills to apply them in professional activities and the skills to choose and apply methods for the collection and acquisition of knowledge. To develop the knowledge and skills needed to meet the challenges of data analysis and artificial intelligence using a modern computing base. Acquisition of theoretical knowledge in data analysis and artificial intelligence. The ability to use a modern computing base to meet the challenges of data analysis and artificial intelligence. Select and develop the software components of artificial intelligence systems and set objectives for developing or improving methods and algorithms to address a set of objectives in the subject area. To acquire practical skills in the use of a modern computing base to solve artificial intelligence problems. The test work shall be carried out in the form of a test. The signal defined at fixed times (set) and continuous in status is called: 1.     Discrete signal 2.     Analog signal 3.     The system &apos; s digital response to a digital single pulse at zero initial conditions is called: 1.     Transitional characteristic 2.     Pulse characteristic 3.     The amplitude frequency characteristic is: 1.     The emergence of additional components in the spectral composition of the sequence in the calculation of APF 2.     Increase the frequency of the spectral lines (decrease in the frequency discreteization period) by supplementing the sequence with zeros 3.     The expansion of the spectrum by multiplying the signal into a special extension sequence of the Filter, which transmits the spectral components of the signal in a given frequency band and suppresses the spectral components of the signal outside the band is called: 1.     Lower frequency filter 2.     Stripper (band) filter 3.     List the following tasks using reverse identification and adaptive filters: 1.     Evaluation of the pulse characteristic of unknown system 2.     Cleaning the noise signal 3.     Compensation for distortions introduced by the unknown system Signal, defined at fixed times (selected) and quantumd by status, is called: 1.       Discrete signal 2.       Analog signal 3.       The system &apos; s digital response to a digital single jump at zero initial conditions is called: 1.       Transitional characteristic 2.       Pulse characteristic 3.       The amplitude frequency characteristic of the filter, which suppresses the spectral components of the signal in a given frequency band and transmits the spectral components of the signal outside the band, is called: 1.       Upper frequency filter 2.       Stripper (band) filter 3.       The change in signal discreteity frequency in a single number of times is called: 1.       Interpol 2.       Decimation 3.       Resecreting Signal, continuous in time and status is called: 1.       Discrete signal 2.       Analog signal 3.       The ASIC digital signal is 1.     Class PLIS 2.     PLIS 3 manufacturer.     The custom chip based on programmable logic is now the Open Standard for Programs for GPU 1.     OpenCL 2.     C++ 3.     JAVA The two firms are the world's leaders in the production of PLIS 1.     Intel FPGA (Altera), Atmel 2, Intel FPGA (Altera), Hilinx 3.     The MaxV families of Intel FPGA (Altera) do not belong to the following 1.     Cyclone 2.     Virtex 3.     Arria This discharge capacity has DSP units at Intel FPGA (Altera) 1. 9x9 2. 18x18 3. 20x20. In addition to Nvidia, Nvidia has distributed computation technology on graphics processors.     Intel 2. AMD 3.     Apple A barrier for a group of processes or flows means that 1.     Each flow(s) shall stop at this point and wait for all flow(s) of group 2 to reach the barrier.     The implementation of the programme is no longer possible.     All the flows after the barrier are combined by Intel FPGA (Altera) IDE for the PLIS design called 1.     Quartus II 2.     Vivaldo 3. AVR-studio Utilite in Quartus II for real-time debugging is called 1.     SignalTap 2.     SignalProbe 3.     ChipPlanner. The ticket contains two theoretical questions from the list (from each group of one question). I. Introduction. Artificial intelligence. Car training. General statement of the task of case-learning. Typology of case studies. Busting. Bagging. Areas of application of IE. Artificial intelligence and machine learning. How to prepare data for modelling: 5 Data Reparation operations. Why do you have to prepare the data for modelling? As Data Scientist produces data: methods and tools Data Reparation. Take what Data Mining needs: how to form a dataset for machine learning. What's a dataset for Data Mining and what it's made of. Where to find the datasets. What kind of dataset is: types of samples. How to make a sample for Data Mining. Why do you need data clean-up for Data Mining: the top 10 issues in the production of the dataset and how to solve them? What is data cleansing for Data Mining? That's what we need to clean up the big data. As Data Scientist cleans the data: the details of the Data Reparation phase are not bug, it's ficha: the generation of signs for Data Mining. Signs for Data Mining: Definition and species. How signs are generated: 3 tasks of this Data Mining phase and how to solve them. Data Reparation: flight is normal – what is normalization of data and why it is needed. Data collection, storage and preparation. Supplement, fill (delete) the missing values. Raw data. Emissions. Causes of emissions. Determination of emissions. Emission criteria I. Histogram. A box with a mustache. Schowen's criterion. The Grabbs Criterion. Pierce's criterion. Dixon's criterion. Rule 3 sigm. Emission criteria II. Statistical tests. Model tests. Iteration methods. Meteorological techniques. Methods are a substitute for task. Methods of machine learning. Ansamble of algorithms. ROC analysis. Noise signal cleaning algorithms. Transforming Fourier. It's a vavelet. It's a transformation. Vinera filter. The algorithms Empirical Mode Decomposition and Intrinsic Time\\Scale Decomposition. Algorithms to clear images of noise. Model noises. Noise types: analog, digital. Sound control techniques: spatial, temporal, spatial, temporal. The quality of the noise. Quality metrics: PSNR and SSIM. The middle filter. Median filter. The Gaussian filter. Battery filter. NLM algorithm. Data preparation. Identification of anomalies in raw data, cleaning of noise data. The task of classification. Types of input data. Type of class. Areas of application. A formal problem statement. Classification algorithms. The method of the nearest neighbors. Bayesian Classificationator. Trees of decision. Classification. The task of clustering. Types of input data. The objectives of clustering. The function of distance. A formal problem statement. Clustering algorithms. Kaverage method. (c) Method of emergency. Genetic algorithm. Clusterization. The challenge is to find the rules of association. A formal problem statement. Concepts. The process of building association rules. Associative rules algorithms. Searching for associate rules. Approximation. Problem statement. The method of least squares. Linear appendix. Logarithmic appendix. It's an exponential appendix. It's a top-down approximation. Interpolation. Problem statement. Local and global interpolation. The Interpol multi-member Lagrangian. Newton's Interpol multi-member. Extrapolation. Time series. Time series components. Combining the components of the time series. It's a trend estimate. Types of functional addictions. Discretion of trend. The sliding medium method. The method of exponential smoothing. Forecasting. Double exponential smoothing. Holt's method. The quality of forecasting. Approximation, interpolation and extrapolation. Time series: trend, seasonality, noise. Forecasting. Approximation. Problem statement. The method of least squares. Linear appendix. Logarithmic appendix. It's an exponential appendix. It's a top-down approximation. Interpolation. Problem statement. Local and global interpolation. The Interpol multi-member Lagrangian. Newton's Interpol multi-member. Extrapolation. Time series. Time series components. Combining the components of the time series. It's a trend estimate. Types of functional addictions. Discretion of trend. The sliding medium method. The method of exponential smoothing. Forecasting. Double exponential smoothing. Holt's method. The quality of forecasting. Correlative analysis. Regression and regression analysis. Linear regression. Non-linear regression. Regressive analysis. What is a neural network (NN)? Chronology. Classification of HC. Phases of the task. Fields of application of NCs. The structure of the neuron. Synaps. Principles for the work of the NC. Activation function. Training, validation, testing. Iteration. An era. Error. Neiron's shifting. Training of the NC. Gradient descent. Reverse-distribution Method (IRM). Hyperparameters. Consequence. Retraining. Neuronets. Synthetic neural networks (SNA). SNA architecture. A layer of folds. Activation layer. Pulling or subdiscretionary layer. Full-fledged NC. SNA training. Benefits of the SNA. Deficiencies of the SNA. Screen neural networks. Digital signal processing processors (PTCs). Graphic processors (GPU). Programmable Integrated Logical Schemas (PLIS). CUDA. Crystal systems (SoC) technology. Languages of mathematical and scientific calculations: MATLAB, Python, R."
]