[
    "Discipline is focused on issues related to the holistic understanding of automated design systems: the types of support and development. Questions are consistently presented: the nature of the design process, the methodology of the design approach, the need to move to automated design. The design phases are presented in terms of a systematic approach to the design of complex systems. The basic principles for the construction and functions of automated design systems (SAP) are being considered. Examine and use of the SARP framework for the design of technology and technology management tools and systems. Ownership: knowledge of the automated design techniques and technologies for the automated design of model systems for the automatic management of technological processes; ability to formulate design objectives and objectives; and reasonable choice of software tools for automated design; practical application of basic, including automated design techniques; mathematical methods used as a basis for design and optimization of project solutions. To develop knowledge of and provide modern SARP, skills in modern systems and devices. Ownership: knowledge of modern software platforms and application packages used for the automated design of systems and devices in various industrial sectors; skills to use standard and specialized software to develop and make the necessary design calculations; technology applications to meet technology management challenges through the use of SCADA systems. Development of the main phases of the design of controls using the example of devices for industrial automation systems. Ownership: knowledge of the principles and methods of system design, basic support for automated design processes; skills to develop design documents for the designable device; techniques for designing the functional units of automatic control systems based on SARP, including: development of the electrical policy framework; computerization of the printed circuit, drawing of the device. No. 1 Moodle monitoring. There will be a number of theoretical issues in the monitoring work that need to be answered correctly. There are also a number of interactive issues. For example: - Basic features of the design of printed charges. What features should be taken into account in the design of printers? - Show me the elements on the chart with the marker. The marker(s) to which the name is attached to the relevant element of the scheme. Note the following elements on the chart: - Transformer, Operation Force (OP) - Transistor - What is CAE? Introduction. General provisions and objectives of automated design. Automated design features. Main stages of the design and design tasks with computing equipment. Automated Design Systems (SAP). Project challenges. Project procedures. Combined automated design algorithm. Topic 1. Automated design processes. Model solutions in the area of SARP electrical equipment. General characteristic and specificity of SAPR. Classification of SARP. Integrated SAPR (CAD/CAM/CAE). General architecture of modern SAP electrical installations. Altium Designer. SAPR AutoCAD Electrical. Three-dimensional design package Creo Parametric. Systems for automating research. Components of SAP subsystems (methodical, linguistic, mathematical, programmatic, technical, information, organizational support). Main objectives of technological (functional) design and design (engineering) design of tools and management systems. Topic 2. Technical support. Designation and general specifications of the technical support. Data-processing software. Means of data preparation and entry. Data presentation and documentation. Project archive. Means of data transmission. Technical kits. Topic 3. Mathematical security. Designation and general characteristic of mathematical security. The hierarchy of mathematical models as the basis for a blunt and hierarchical approach to the design of management tools and systems. Methodology for mathematical models at different hierarchical levels. Mathematical models. Morphological description of design facilities. Structural and geometric models. Functional description of design facilities. Classification and main types of functional models. Methods of project decision-making. Project synthesis algorithms. Topic 4. Software. Designation and generalization of SAPR software. Operations systems. Computer network software. Programming systems. General-purpose packages. SAPR special software. SAPR application packages. Expert systems in design. Interactive graphic systems. Machine graphics. Special features of the SAPR machine schedule. Collective use dialogue systems of SAPR. Automated design of technology management systems based on SCADA systems. Clothing services: SAP as a service technology. Topic 5. Information technology. The essence and composition of the SARP information supply as part of modern information technology. Principles for building databases and data banks and ways of harmonizing programmes in the development of the database. Relay, network and hierarchical database models. Data security and integrity. Topic 6. Linguistic security. Designation and general characterization of language support. Language manager. Basic language services. Language processors. Topic 7. Methodological and organizational support. Designation and general characteristic of the method. Methodological support: general description, operational instructions, language description, description of project procedures. Designation and overall organizational performance. Conclusion. Analysis of the impact of the automation of design and construction on the quality of design products. Trends in the further development of computer design tools in the instrumentation. Analysis of the demand of SAPR specialists in the labour market in the north-west region.",
    "The discipline examines methods, tools and technologies for the automated design of complex mechanized modules and robots, phases and stages of product life cycle, development and design, role and location of automated design systems (SAP). Disciplinary information is provided on the main methods and means of establishing schematic and textual documentation of the electrical project using specialized SARP. It addresses the exchange of information in automated design using different SAPRs. The discipline reviews the model composition and develops project documentation for the examples of mechanized modules and robots as per the standard. Practical exercises and laboratory work are aimed at the development of SAP specialized electrical engineering design tools using examples of mechantronized modules and robots. Knowledge of the basic concepts of the SARR in designing the parts of the mechanized modules and robots as a tool for describing products during its life cycle. To develop the skills of automated geometric modelling in SARP, the basic principles for the design and design documentation of mechanical modules and robots. Knowledge of the basic concepts of the schematic part of the design and development of the parts of the mechanized modules and robots, the skills to accommodate the elements of the diagram on the installation panels of electrical assemblies (scales). Objective: To make independent in-depth use of the SAP Electrotechnical Opportunity in designing electrical appliances based on laboratory and practical skills. The content of the assignment: the baseline data are: a brief description of the design devices, their basic policy frameworks (imijis), information from the equipment and construction companies (scales, remotes). The result is project documentation: electrical circuits, connections, list of elements, tables of compounds. The report should also include the main phases of the development of project documents by the SARP. The topic of individual assignment: &quot; Projecting the Electrical Control Element at SAPR AutoCAD Electrical &quot; . The theme of individual task: Design of element management system of the actuator in CAD AutoCAD Electrical. The procedure for the issuance, execution and evaluation of individual household tasks is determined by the method of ongoing monitoring. Examples of issues related to differential subtraction of the geometric modelling technology in SAPRO AutoCAD. Positioning systems and means of entry of points. The designs. Characterization, speciation, reference dimensions. Large architecture, lines, size, geometric systemic properties. Methods for the creation and editing of flat lengthy models. Primitations, compounds, blocks and groups. Methods of building and using libraries. External references, composite documents and OLE technology in site modelling. General characteristics of SARP AutoCAD Electrical. Design phases and composition of automation projects. Types and types of schemes, general rules for the implementation of electrical documents. The notion of ECCD standards. Structural and functional measurement and automation schemes. Designation of functional schemes, methodology and general principles for their implementation. Image of technology equipment and communications. Presentation of measurement and automation equipment. Positioning symbols of devices and automation equipment. Processing requirements and performance examples. Basic electrical circuits. General requirements. Rules of implementation. Symbols of schematic elements. Charging and wires. Symbols of diagrams and their decoding. Selection of protection and computation equipment. Appointment and general requirements. Selection of voltage and requirements for power sources. Selection of the power supply, reservation and automatic inclusion of the reserve. Electrical control and protection equipment. Selection of control and protection equipment. Places of control and protection equipment. The selection of wires and cables. External connections and connections. General provisions. External connections. External wire connection schemes. Tables of external wire connections. External wire connection tables. AutoCAD Electrical. Project documents. Documents and projects. The files. Master of the graphic menu. Agreement on the names of clusters of graphical samples. Graphic samples. Attribution. Reading the attribute, the properties of its display. Reappointment of the attribute. Building a library of graphics. Editor of graphics. Procedure for the establishment and editing of the CPP in accordance with the CEB. U.S. Attributes. Parental and daughter components. Establishment and construction of a user library of graphics. Cynthaxis library file. Names of the catalogue database tables. Catalogue tables field. A cataloguing component. Updating components from the catalogue base. Editorial of the catalogue database. The concept of wire, chains, cables, circuits. Use of chains. Trailer. Tools for wire work. Numbering of wires. Checks of wires. It's a broken wire architecture. Clementing, editing. Boxing clams and connectors. Your limbs. Clembridge editor. Connection points, interchanges, multi-level klems. PLC. Review of the PLC database file. Formation and supply of PLC modules. Points of entry/off. Appendix of the PLC module to the database. Filling up the basic record. Electrical graphic menu components. Construction of communication lines (conducts). Create layers of wire. Organization of AutoCAD Electrical documents. Cross-references. Project tools (renewal of components, wires, tracking of changes). General information on the premises. The relationship between the drawing of the scheme and the structure of the panel. Creation of a design, editing. Positions and position numbers. Connection points. Corps and DIN raids. What geometric models are used in design? Give me the concept of geometric models. The basic concepts and terminology of SAPR for a two-pillar design. Electrical engineering automation systems. Reclassify electrical engineering design automation systems. Structural and functional electrical circuits. Give me a definition of Structural Electrical schemes. Determine functional electrical circuits. Basic electrical circuits. Rules for the establishment of electrical circuits. Examples of questions to colloquium 2 Specification to the basic electrical circuit. Essential electrical connections and connections of the External Compounds and Connections Creation of the AutoCAD Electrical Electrical Electrical Electrical graphics (components) in AutoCAD Electrical Adaptation of the AutoCAD Electrical Graphics Library. Catalogues AutoCAD Electrical Cepy and wires in AutoCAD Electrical PLC in AutoCAD Electrical Electrical Basic Electrical diagrams and diagrams of AutoCAD Electrical compounds, AutoCAD Electrical mounting plates in AutoCAD Electrical AutoCAD Electrical Example Issues for testing residual geometric modelling Positioning systems and means of entry of points. The designs. Methods for the creation and editing of flat lengthy models. Methods of building and using libraries. External references, composite documents and OLE technology in site modelling. General characteristics of SARP AutoCAD Electrical. Design phases and composition of automation projects. Types and types of schemes, general rules for the implementation of electrical documents. The notion of ECCD standards. Structural and functional measurement and automation schemes. Image of technology equipment and communications. Presentation of measurement and automation equipment. Positioning symbols of devices and automation equipment. Processing requirements and performance examples. Basic electrical circuits. Rules of implementation. Selection of protection and computation equipment. Appointment and general requirements. Selection of voltage and requirements for power sources. Selection of the power supply, reservation and automatic inclusion of the reserve. External connections and connections. General provisions. AutoCAD Electrical. Project documents. Documents and projects. The files. Master of the graphic menu. Agreement on the names of clusters of graphical samples. Graphic samples. Building a library of graphics. Editor of graphics. Procedure for the establishment and editing of the CPP in accordance with the CEB. U.S. Attributes. The concept of wire, chains, cables, circuits. Clementing, editing. PLC. Review of the PLC database file. Formation and supply of PLC modules. Filling up the basic record. Electrical graphic menu components. Organization of AutoCAD Electrical documents. Cross-references. Project tools (renewal of components, wires, tracking of changes). Introduction. Subject of discipline, its tasks and its connection with other courses in the field of training of the Bachelors in line 15.03.06. Product life cycle, stages, stages and design methods. Demonstration of modern trends in automated design. Topic 1. Geometric models. Geometric modelling technology at SAPR AutoCAD. Positioning systems and means of entry of points. The designs. Topic 2. The basic concepts and terminology of SAPR for two-way design. Characterization, speciation, reference dimensions. Large architecture, lines, size, geometric systemic properties. Methods for the creation and editing of flat lengthy models. Primitations, compounds, blocks and groups. Methods of building and using libraries. External references, composite documents and OLE technology in site modelling. Topic 3. Electrical engineering automation systems. General characteristics of SARP AutoCAD Electrical. Design phases and composition of automation projects. Types and types of schemes, general rules for the implementation of electrical documents. The notion of ECCD standards. Topic 4. Structural and functional electrical circuits. Structural and functional measurement and automation schemes. Designation of functional schemes, methodology and general principles for their implementation. Image of technology equipment and communications. Presentation of measurement and automation equipment. Positioning symbols of devices and automation equipment. Processing requirements and performance examples. Topic 5. Basic electrical circuits. General requirements. Rules of implementation. Symbols of schematic elements. Charging and wires. Symbols of diagrams and their decoding. Topic 6. Basic electrical circuits. Selection of protection and computation equipment. Appointment and general requirements. Selection of voltage and requirements for power sources. Selection of the power supply, reservation and automatic inclusion of the reserve. Electrical control and protection equipment. Selection of control and protection equipment. Places of control and protection equipment. The selection of wires and cables. Topic 7. External connections and connections. General provisions. External connections. External wire connection schemes. Tables of external wire connections. External wire connection tables. Topic 8. Establishment of an electrical project in the environment in AutoCAD Electrical. AutoCAD Electrical. Project documents. Documents and projects. The files. Theme 9. Creation of graphics (components) in AutoCAD Electrical. Master of the graphic menu. Agreement on the names of clusters of graphical samples. Graphic samples. Attribution. Reading the attribute, the properties of its display. Reappointment of the attribute. Building a library of graphics. Editor of graphics. Procedure for the establishment and editing of the CPP in accordance with the CEB. U.S. Attributes. Parental and daughter components. Theme 10. Adaptation of the AutoCAD Electrical graphic library. Catalogi AutoCAD Electrical. Establishment and construction of a user library of graphics. Cynthaxis library file. Names of the catalogue database tables. Catalogue tables field. A cataloguing component. Updating components from the catalogue base. Editorial of the catalogue database. Theme 11. Ceps and wires to AutoCAD Electrical. The concept of wire, chains, cables, circuits. Use of chains. Trailer. Tools for wire work. Numbering of wires. Checks of wires. It's a broken wire architecture. Theme 12. Clemmas in AutoCAD Electrical. Clementing, editing. Boxing clams and connectors. Your limbs. Clembridge editor. Connection points, interchanges, multi-level klems. Topic 13. PLC in AutoCAD Electrical. PLC. Review of the PLC database file. Formation and supply of PLC modules. Points of entry/off. Appendix of the PLC module to the database. Theme 14. AutoCAD Electrical, AutoCAD Electrical. Filling up the basic record. Electrical graphic menu components. Construction of communication lines (conducts). Create layers of wire. Organization of AutoCAD Electrical documents. Cross-references. Project tools (renewal of components, wires, tracking of changes). Topic 15. AutoCAD Electrical installation unit. General information on the premises. The relationship between the drawing of the scheme and the structure of the panel. Creation of a design, editing. Positions and position numbers. Connection points. Corps and DIN raids. Conclusion. Simple reports to AutoCAD Electrical. AutoCAD Electrical. Formulation of chart reports and installation panels. Imports and exports of the electronic table. Adding user reports. Trends and prospects for automation of design. Role and location of information technology in automation",
    "The discipline examines the mathematical methods of analysis of the sustainability of dynamic systems: the first Läpunov method, the Läpunov method, the method of analysis of the sustainability of linear systems, not studied in the basic course of the automatic management theory. Methods for synthesis of laws for the management of dynamic objects using the theory of sustainability, in particular the algorithms of the gradient. Key concepts and results of the sustainability, rudeness and deficiency of uncertain systems are given. Stability of dynamic systems. Basic knowledge is acquired on the mathematical theory of sustainability and the practice of its methods. Basic knowledge is being developed on mathematical methods of studying the sustainability of traffic and the balance of linear and non-linear systems of automatic management, as well as methods of synthesis of management laws based on theory of sustainability. Sensitivity and sustainability analysis skills through the first and second methods of Läpunov, the algorithm of the gradient, the harthon methods, the methods of analysis of the sustainability of linear systems. Issues for the first review of the OMTU course Theoretical issues 1. Linearization of multiple variables (definition). 2. Linearization of equations in the form of variable status (definition). 3. Balance (definition, method of finding). 4. Liaponov sustainability and asymptotic sustainability (definitions). 5. Criteria for Sustainability of Mikhailov (formulation, graphical illustration, including location on the border of sustainability). 6. Lapunov &apos; s first method (theorem). Target 1. Liearize the assigned non-linear function of several variables in the vicinity of the given point. 2. Determine c. λ1 and λ2 and make an opinion on the type of matrix R (p., o., etc.). 3. For square form Q (x 1, x 2) =. = xT Rx, record the R matrix and determine its type by means of the Silvester criterion. The monitoring work is designed for two academic hours. Each student will have an individual set of theoretical issues and tasks from the above lists. 1. In the linearization of the equations of the non-linear system, the &quot; working point &quot; is (a) the point of the established mode (b) the initial state of the system and) any condition of system 2. The linearized equation differs from the original non-linear one that it is (a) more simple (b) more accurate in) approach 3. The matrix exponent is defined as (a) the phasing row (b) of an endless grading row in a) trigoometric row 4. What equation satisfies the matrix exhibit? (a) the reference differential equation (b) of the Lapunov equation in the characteristic equation 5. How many polynoms have to be tested for sustainability in the first theorem of Hariton? (a) n(b) 2 to n (b) 2 to n+1 6. How many polynoms should be tested for sustainability in the second theory of Hariton? (a) 4 (b) 2 (c) n 9. Lapunov &apos; s first method is the case. (a) with low-b sustainability, with overall sustainability in large 10. In the adaptive system, the reference model is usually taken. (a) a management model with nominal parameters (b) an arbitrary dynamic system with desired dynamics in a system with a better dynamic than the control object. The features of non-linear systems. Mathematical dynamic system models. Types of mathematical dynamic modelling. Nonlinear systems. Static and dynamic non-linear links. Comparison of nonlinear systems. Description of non-linear systems in the environment. Topic 2. Linarization of non-linear mathematical models. Linearization of a non-linear static characteristic, a function of one variable, by decomposition to a number of Taylors. Linearization of multiple variables. Linearization of equations in the form of variables. Linearization practices. Topic 3. Quarterly forms. Quarterly (possibly and negatively defined) and permanent signs (properly semi-defined and negatively semi-defined) and their respective matrices. Undetermined (meeted) square shapes. Criterium Sylvester. Relationship between the type of matrix and its own values. Liapov's role. Topic 4. Decision of the matrical equation of state. Dynamic system balance. Transition matrix. Matrix and methods for defining it. Formula Koshi. State of balance. Methods for determining the balance. Topic 5. Sustainability of the balance and the solutions of the differential equations. Sustainability of balance. Liaponov sustainability and asymptotic sustainability (small and general). Sustainability of solutions to differential equations. Lapunov's first method. Topic 6. Some methods for analysing the sustainability of linear systems. Criteria for the sustainability of Rausa, Lienara-Shimara, Mihailova, Lipatova-Skolov. Topic 7. Lapunov's second method. Liapov's role. Lapunov &apos; s role in the analysis and synthesis of non-linear systems. Theorems of Lapunov, Krasovsky and Barbashina Krasovsky on sustainability and asymptotic sustainability. Theorems of Lapunov and Chetaev on the volatility of traffic. Liapun's equity. Topic 8. Methods of building Lapunov's functions. Method of undetermined coefficients. Functions of the Lapuna species &quot; quadratic form plus integration from non-linearity &quot; . Theme 9. Applying theory of sustainability in the synthesis of adaptive systems. Some matrix algebra results. Comparison of the adaptive system with the reference model (ASEM). The parametric adaptation synthesis of the algorithm in the ASEM based on the second method of Lapunov. Equation and structure of ASEM. Theme 10. A high-speed gradient algorithm. Algorithm of the gradient and its application to the synthesis of the adaptive system. Theme 11. Undefined systems management. Undefined facilities and systems. Gross and fat. Adaptive governance. Interactive systems. Hariton's theorems.",
    "The divergence of the optimum management theory includes the provision of guidance on how to deal effectively with optimization objectives, synthesis of optimum regulators for linear and non-linear automatic systems. The study of discipline addresses issues related to the task of optimization, the selection of the optimum criteria, the main methods of decision-making in an uncertain environment. The algorithms for optimization, the basic methods for synthesizing best governance laws for linear systems are being considered. Examination of basic methods and knowledge of the algorithms of solutions to model optimization objectives. Development of optimization and analytical design of best management systems. Knowledge and practical skills in MATLAB applications. 1. Extreme search with unrelated optimization areas. 2. Uniform search methods. 3. Gradiant optimization techniques. 4. A consistent symple method with a constant step. 5. A consistent symple method with a constant step. 6. A consistent symple method with a variable step. 7. Neldera-Mida method. 8. Methods of finding an extremist in a multi-purpose effort. 9. Sliding tolerance method. 10. Expert evaluation methods. The method of rank. 1. Determination of the optimum controller on the management economic criterion for the control object set by the system of equations in the form of Koshi. Example. 2. Determination of the optimum control control over the control cost-saving criterion for the control object assigned to the differentiational equation of the 2nd order. Example. 3. Determination of the optimum controller on the management economic criterion for the control object assigned to the structural scheme. Example. 4. Determination of the optimum controller for the integrated square criterion for the control object set by the Koshi-form equation system. Example. 5. Determination of the optimum controller for the integrated square criterion for the control object assigned to the differentiational equation of the 2nd order. Example. Introduction. Objectives and objectives of discipline. Relationship to other disciplines. Disciplinary literature review. Topic 1. Main objectives for optimal systems. Historical background and examples of classical optimization objectives. Current state of theory of operations. Brief overview of optimization objectives and classification of how to deal with them. Specification of optimization at stages of research, design and operation of technical systems. Topic 2. Mathematical formulation of optimization. Selection of optimized parameters. Establishing the optimum test. Speculation and synthesis criteria. Extremum, necessary and sufficient conditions for its existence. Scared functions. Implicity. Normation of indicators and parameters. A conditional and unconditional extremist. Topic 3. Multi-stage methods for finding an extremist function as one variable. Liabilities and active strategies to reduce uncertainty. Comparative analysis of methods of breaking uncertainty. Gold section and dichotomy methods. Topic 4. Finding an extremist role for several variables. Methods of conditional and unconditional optimization. Gradiant methods, Newton method, symple techniques. Lagrang's multiplier method. Instant search methods. Methods for addressing multiple and ambiguous challenges. Topic 5. Methods for addressing optimization in a context of incomplete a priori information. Choice the preferred solution. Probability, minimal, weighted decision-making. Selection of optimal management parameters. Topic 6. Vector optimization. Target setting. Main indicator method. Flexible priority methods. Methods for determining weight multipliers. Selection of optimal management parameters. Topic 7. Best management systems. Installation of optimum management. Optimization criteria. Functional, extremus worked, necessary and sufficient conditions. The principle of optimism of R. Bellman. Dynamic programming. Synthesis of optimum systems based on variation. Lagrang's method. Best practice. Optimal management of continuous systems. The principle of maximum L.S. Pontragina. The main theory of the principle of maximum. Synthesis of optimum speed systems. Optimal linear system. Regulator. Relationship between variation, maximum principle and dynamic programming. Conclusion. Trends in discipline. Discipline of residual knowledge. Examples of practical disciplinary tasks.",
    "Discipline includes laying out the foundations of manipulative robots theory and management methods. The main information on the dynamics of manipulative mechanisms, the mathematical models of traffic and the methodology for analysing them are considered. Methods and algorithms of cinematic management of manipulators are discussed in detail. Discipline is supported by a large number of practical and laboratory activities, as well as by the independent work of students in the main sections of the programme. Examine the basis of theory of manipulative robots and their management. Ownership: knowledge of basic cinematic ratios; ability to formulate direct and reverse positioning tasks and direct and reversal tasks on the speed of manipulator links; and skills to build a manipulator management algorithm. Formulation of a common understanding of the dynamics of manipulative mechanisms, mathematical models of traffic and methods of analysis. Ownership: knowledge of the dynamic performance of the manifold; ability to compute the force algorithms and reaction moments of the manipulator links; skills to develop the differentiational equations of the manipulator movement relative to the generalized coordinates. To develop the skills of the methods of study and calculation of the executive system of manipulative robots. Ownership: knowledge of the automated synthesis of mechanized systems; skills to develop management systems for mechanized and robotic technology complexes; simulation skills for mechanized and robotic technology complexes. Example questions to the colloquium: 1. Write the equation of the static balance of the three-star manipulator containing only progressive cinematic vapours 2. Write the equation of the static balance of the three-letter manifold containing only the steady vapours of rotation 3. Write the static balance equation for the PUMA-560 six-star manifold, with the first three pairs rotating and three consecutive rolling. 4. Write a ratio defining the reaction force and the reaction of the manipulator &apos; s three revolving couples. 5. Explain why it is advisable to use a reverse-recurrence method to calculate the forces and moments of the manifold. 6. Set the force algorithm and reaction moments of the manipulator line with a flat three-star structure with rotary vapours if the combined coordinates are presented. 7. Set up an algorithm to compute the ellips of the developing forces for a flat two-star manipulator. 8. Explain to what practical tasks the ellipsoids of developed force manipulator could be used. 9. What characterizes the main ellipsoid axis: their size or direction? 10. Formulate the first and second dynamic objectives for the manipulation mechanism. Introduction. Subject of discipline and its tasks. Structure and content of discipline, its relationship to other disciplines in the curriculum. Topic 1. Main cinematic relationships. Manipulator is a mechanical system. Transformation of coordinates, uniform coordinates and transformation. Determination and orientation of manifold links, special reference systems. Topic 2. Manipulator position in the working space. Direct and reverse positioning challenges. Geometrics of the manipulator's working space. Topic 3. Speed and acceleration of the manifold. Rotation of a solid body. Speed and acceleration of the manifold. Direct and reverse speed. Cinematic properties of manipulators. Topic 4. Cinematic manipulator control. Trajectory planning in the area of the generalized coordinates. Manipulator control in the area of the quest. Topic 5. Comparison of manipulator kinetomatics. Statics of manipulative mechanisms. Workforce and moment analysis. Dynamic performance of manipulator. Topic 6. Executive level management system. Mathematical model of the executive system, a study of the linear model. Automated synthesis of the executive system. Topic 7. Methods of dynamic manipulation. Methods based on reverse dynamics. Management decomposition, power feedback and dynamic planning. Topic 8. Logical management of a complex robotic system. The concept of a complex system, subsystem modelling, a web machine, a network of automatics. Management of a complex robotic system. Conclusion. Prospects for the development of mechanized and robotic systems.",
    "The divergence of the optimum management theory includes the provision of guidance on how to deal effectively with optimization objectives, synthesis of optimum regulators for linear and non-linear automatic systems. The study of discipline addresses issues related to the task of optimization, the selection of the optimum criteria, the main methods of decision-making in an uncertain environment. The algorithms for optimization, the basic methods for synthesizing best governance laws for linear systems are being considered. Examination of basic methods and knowledge of the algorithms of solutions to model optimization objectives. Development of optimization and analytical design of best management systems. Knowledge and practical skills in MATLAB applications. 1. Extreme search with unrelated optimization areas. 2. Uniform search methods. 3. Gradiant optimization techniques. 4. A consistent symple method with a constant step. 5. A consistent symple method with a constant step. 6. A consistent symple method with a variable step. 7. Neldera-Mida method. 8. Methods of finding an extremist in a multi-purpose effort. 9. Sliding tolerance method. 10. Expert evaluation methods. The method of rank. 1. Determination of the optimum controller on the management economic criterion for the control object set by the system of equations in the form of Koshi. Example. 2. Determination of the optimum control control over the control cost-saving criterion for the control object assigned to the differentiational equation of the 2nd order. Example. 3. Determination of the optimum controller on the management economic criterion for the control object assigned to the structural scheme. Example. 4. Determination of the optimum controller for the integrated square criterion for the control object set by the Koshi-form equation system. Example. 5. Determination of the optimum controller for the integrated square criterion for the control object assigned to the differentiational equation of the 2nd order. Example. Introduction. Objectives and objectives of discipline. Relationship to other disciplines. Disciplinary literature review. Topic 1. Main objectives for optimal systems. Historical background and examples of classical optimization objectives. Current state of theory of operations. Brief overview of optimization objectives and classification of how to deal with them. Specification of optimization at stages of research, design and operation of technical systems. Topic 2. Mathematical formulation of optimization. Selection of optimized parameters. Establishing the optimum test. Speculation and synthesis criteria. Extremum, necessary and sufficient conditions for its existence. Scared functions. Implicity. Normation of indicators and parameters. A conditional and unconditional extremist. Topic 3. Multi-stage methods for finding an extremist function as one variable. Liabilities and active strategies to reduce uncertainty. Comparative analysis of methods of breaking uncertainty. Gold section and dichotomy methods. Topic 4. Finding an extremist role for several variables. Methods of conditional and unconditional optimization. Gradiant methods, Newton method, symple techniques. Lagrang's multiplier method. Instant search methods. Methods for addressing multiple and ambiguous challenges. Topic 5. Methods for addressing optimization in a context of incomplete a priori information. Choice the preferred solution. Probability, minimal, weighted decision-making. Selection of optimal management parameters. Topic 6. Vector optimization. Target setting. Main indicator method. Flexible priority methods. Methods for determining weight multipliers. Selection of optimal management parameters. Topic 7. Best management systems. Installation of optimum management. Optimization criteria. Functional, extremus worked, necessary and sufficient conditions. The principle of optimism of R. Bellman. Dynamic programming. Synthesis of optimum systems based on variation. Lagrang's method. Best practice. Optimal management of continuous systems. The principle of maximum L.S. Pontragina. The main theory of the principle of maximum. Synthesis of optimum speed systems. Optimal linear system. Regulator. Relationship between variation, maximum principle and dynamic programming. Conclusion. Trends in discipline. Discipline of residual knowledge. Examples of practical disciplinary tasks.",
    "Productive practices are the main stage of practical training, which reinforces the theoretical knowledge and practical skills gained at previous stages of education, which will form the basic skills and skills. Study of the modern structure of the enterprise and production; the operating principles of the individual control systems; the process of the manufacture of parts and components of automatic control systems; the examination of software products needed for the calculation and analysis of schematic decisions and the design of design documents. Ownership: knowledge of the structure of the enterprise or organization, the functions of its units, their interrelationships and subordination; knowledge of the stages of the technological process for the manufacture of selected components and components of information and energy electronics; the ability to collect and analyse baseline data for the calculation and design of management systems, schemes and devices of different functional uses; the ability to apply for spare parts and consumables, and the verification and calibration of equipment; Develop skills for the construction, assembly and testing of automatic control systems, as well as skills to process, present and report the results of the work performed. Ownership: knowledge of current trends in information technology development in production management systems and automated production management systems; technology training for materials and products of management systems; techniques to develop, test, validate the performance of measuring, diagnostic, technological equipment used to address various scientific, technological and production challenges in management systems; techniques to conduct preventive maintenance Development and maintenance of software products needed to calculate and analyse schematic decisions, design documents; development of software products for technology management in automated production management systems. Ownership: knowledge of the stages of development of knowledge-intensive products; knowledge of basic information security requirements in the workplace; skills to develop guidance on the operation of the technical equipment and software used for service personnel; and skills to calculate and design electronic devices, schemes and devices of different functional uses according to technical assignments using engineering tools.",
    "Training is an initial stage of practical learning that embodies the theoretical knowledge and practical skills gained at previous stages of learning, which generates basic skills and skills. Study of information technologies used in the learning process, learning about the electronic library system as a source of individual access to the academic and scientific literature funds, reference and specialized periodicals. Build computer skills, performance, team skills. Development of information technology techniques and skills in the performance and editing of images and drawings by modern means.",
    "The discipline examines the types of robotics of software management, their basic design principles, their characteristics and characteristics, the characteristics of the operational systems and the basic principles for the development of numerical software robots. Acquired students will be directly involved in the practice. Knowledge of the main features of the electric control systems of industrial robots and machines; classification of PPE devices on technological, functional and structural grounds; basic principles for the programming of industrial robot and aggregate electrical systems with PPE. To develop a variety of techniques to meet the programming of industrial robots &apos; electric power systems with EPWs; to analyse systems and devices with CPs in their choices to address design and technology needs; to use different language for the programming of industrial robot electric power systems with EPW. To develop skills for programme managers in low- and high-level languages, to work with modern integrated software development environments for PURs, to design industrial robots electrical systems with CPs. Examples of issues related to the differentiated accounting of the current state of the PCP systems. Basic concepts and definitions. Classification of software management systems for industrial robot electrical systems. Characteristics and design features of the numerical management systems - Position, end-outline and combined PPE systems. CPD systems with a permanent structure and system with a programme of work algorithms. Characteristics and design features of NC-class numerical systems. Characteristics and design features of the CNC numerical systems. Characteristics and design features of other numerical systems. Challenges and design of software. Operational system characteristics. Algorithms and Programmes of Functions for the Management of the Electrical Training Systems of Industrial Robots with the PCP. Challenges and design of software. Operational system characteristics. Algorithms and programmes of management of industrial robots with PCP. General issues of the ERP software. Programming phases. Core programme products for the management of industrial robots with CPs. General structure of software kits for PPS systems. Programming methods. Algorithmic design of programmes for industrial machines and machines with PCP. Means of control and diagnostic of industrial robot management systems with PCP. Principles for the programming of industrial robots with CPs. Methods and tools for the programming of industrial robots with CPs. Coding information and process programming languages. Automation systems for industrial robot programming with PPU. Prospects for the development of CPD systems. Examples of issues to the Colloquium of the Modern Status of the PCP Systems. Classification of software management systems for industrial robot electrical systems. Characteristics and design features of the numerical management systems - Position, end-outline and combined PPE systems. CPD systems with a permanent structure of the System with a programme of work algorithms. Characteristics and design features of NC-class numerical systems. Characteristics and design features of the CNC numerical systems. Challenges and design of software. Operational system characteristics. Algorithms and Programmes of Functions for the Management of the Electrical Training Systems of Industrial Robots with the PCP. Challenges and design of software. Operational system characteristics. Algorithms and programmes of management of industrial robots with PCP. General issues of the ERP software. Programming phases. Core programme products for the management of industrial robots with CPs. General structure of software kits for PPS systems. Algorithmic design of programmes for industrial machines and machines with PCP. Means of control and diagnostic of industrial robot management systems with PCP. Principles for the programming of industrial robots with CPs. Methods and tools for the programming of industrial robots with CPs. Coding information and process programming languages. Automation systems for industrial robot programming with PPU. Prospects for the development of CPD systems. Introduction. Objectives and objectives of discipline. Current status of the CPD systems. Topic 1. Management systems for industrial robots and machine-operated electrical systems. Basic concepts and definitions. Classification of software management systems for industrial robot electrical systems. Characteristics and design features of the numerical management systems - Position, end-outline and combined PPE systems. CPD systems with a permanent structure and system with a programme of work algorithms. Characteristics and design features of NC-class numerical systems. Characteristics and design features of the CNC numerical systems. Characteristics and design features of other numerical systems. Topic 2. The robot software. Challenges and design of software. Operational system characteristics. Algorithms and Programmes of Functions for the Management of the Electrical Training Systems of Industrial Robots with the PCP. Challenges and design of software. Operational system characteristics. Algorithms and programmes of management of industrial robots with PCP. General issues of the ERP software. Programming phases. Core programme products for the management of industrial robots with CPs. General structure of software kits for PPS systems. Programming methods. Algorithmic design of programmes for industrial machines and machines with PCP. Means of control and diagnostic of industrial robot management systems with PCP. Topic 3. Principles for the programming of industrial robots with CPs. Methods and tools for the programming of industrial robots with CPs. Coding information and process programming languages. Automation systems for industrial robot programming with PPU. Conclusion. Prospects for the development of CPD systems.",
    "The theoretical and applied issues highlighted are useful for students specializing in management and information technology in technical systems, computer and mathematical modelling. Data Science is available in the course, which includes data collection, storage and preparation (declaration of raw data anomalies, clean-up of noise data, supplementing data, filling (dulging) of missed values), classification and clustering, searching of associated regulations, interpolation, extrapolation and approximation, correlation and regression networks, and artificial engineering, In addition, the current computing framework is being reviewed in the context of the tasks of Data Science (CUDA, GPU, FPGA, SoC). Attention is drawn to the implementation of practical tasks using modern software (MATLAB, Python, R, GPU). The purpose of the discipline is to study mathematical models, methods and algorithms of data analysis and artificial intelligence and to acquire skills in their application to professional activities and skills in the selection and application of methods of learning and learning. To develop the knowledge and skills necessary to meet the challenges of data analysis and artificial intelligence using a modern computing base. Acquisition of theoretical knowledge in data analysis and artificial intelligence. The use of a modern computing base to address data analysis and artificial intelligence. Choose and develop the software components of artificial intelligence systems and set out tasks to develop or improve methods and algorithms to address a range of substantive tasks. To gain practical skills in using a modern computing base to meet artificial intelligence challenges. Monitoring is done in the form of testing. The signal defined in fixed (data) times and which is continuous as is known as: 1. 2. Analog signal 3. The digital signal of the system &apos; s response to the digital single pulse under zero primary conditions is called 1. Transitional characteristic 2. Impulsive characteristic 3. Speculation of the spectrum is: 1. Additional spectral composition of sequence in the calculation of FS 2. Increase in the frequency of spectral lines (decrease in frequency discontinuation) by adding zero sequence 3. Expansion of the spectrum by multiplying the signal to the specially expanding sequence of the Filtre, which transmits the spectral components of the signal in the given frequency strip and adds the spectral components of the signal outside the strip, is called: 1. Lower frequency filter 2. Flue-producing (polo) filter 3. Indicate which of the following tasks is performed using reverse identification and adaptive filters: 1. Evaluation of the impulse characteristics of the unknown system 2. Clearing the noise signal 3. Compensation for distortions made by the unknown signal system, defined in fixed (data) times and quantified as at: 1. 2. Analog signal 3. The digital signal of the system &apos; s response to a digital single leap at zero primary conditions is called 1. Transitional characteristic 2. Impulsive characteristic 3. An amplitude-frequency profile of the filter that embodies the spectral components of the signal in the given frequency strip and transmits the spectral components of the signal outside the strip is called 1. Upper frequency 2 filter. Flue-producing (polo) filter 3. The retractor (rejector) filter changes in the discretization frequency of the signal to a number of times: 1. Interpol 2. Decimation 3. Re-definition of the signal, which is continuous and is called: 1. 2. Analog signal 3. ASIC digital signal is 1. Class PPE 2. PLEAS 3. The tax microchem based on the programmed logic of the Open Standard for Programming for GPU is now 1. OpenCL 2. C++ 3. These two firms are the world leaders in the production of PPE 1. Intel FPGA (Altera), Atmel 2. Intel FPGA (Altera), Xilinx 3. Xilinx, Atmel is the Intel FPGA PLIS family (Altera) referred to SOC 1. CycloneV 2. ArriaII 3. MaxV does not belong to Intel FPGA (Altera) PPE families. Cyclone 2. Virtex 3. Arria The DSP blocks in the FPGA Intel FPGA (Altera) 1. 9x9 2. 18x18 3.20x20 In addition to the Nvidia firm, the graphic processors have the technology of the 1. Intel 2. AMD 3. Apple Barrier for a group of processes or flows means that 1. Each flow (process) shall stop at this point and wait for the barrier to be achieved by all flows (process) of group 2. The programme is no longer operational. All flows after the barrier are combined with the IDE environment of Intel FPGA (Altera) for PLIS design called 1. Quartus II 2. Vivaldo 3. AVR-studio Utilit in Quartus II for real-time sweeting is called 1. SignalTap 2. SignalProbe 3. ChipPlanner. The ticket contains two theoretical questions from the list (from each group: 1 question). Introduction. Artificial intelligence. Car training. General setting of case studies. Typology of case studies. Busting. Bagging. Scope of I.I. Artificial intelligence and engineering training. How to prepare modelling data: 5 operations Data Preparation. Why do you need to prepare data for modelling? As Data Scientist prepares data: methods and tools Data Preparation. Let's take what Data Mining needs: how to create a dateset for machine training. What's a dateset for Data Mining and what it's made of? Where to find the tapes. Like dataset: sample types. How to form a sample for Data Mining. Why do we need to clean up data for Data Mining: 10 major problems in producing a dateset and how to deal with it? What is data cleansing for Data Mining? That's why you need to clean up the big data. As Data Scientist cleans data: details of phase Data Preparation. It's not a bug, it's a pitch: generating evidence for Data Mining. Acceptances for Data Mining: definition and species. How the signs are generated: three objectives of this phase, Data Mining, and how to deal with them. Data collection, storage and preparation. Data Supplement, filling(s) of missed values. The raw data. Emissions. Reasons for emissions. Emission determination. Emission criteria I. Gistogram. A mustache box. Schoven criteria. Grabbs criteria. Pierce's test. Dixon's test. Rule 3 sigm. Emission criteria II. Statistical tests. Model tests. Iterative methods. Metrical methods. Methods of substitution. Machinery training methods. Ansambly algorithms. ROCanalysis. Noise algorithms. Furier's transformation. Wavelet transformation. Winner's filter. Epirical Mode Decomposition and Intrinsic TimeScale Decomposition. Noise images algorithms. Model noises. Types of noise: analog, digital. Methods of noise suppression: spatial, temporal, spatial. Noise quality. Quality meters: PSNR and SSIM. Medium filter. Media filter. Gaussian filter. Pilate filter. NLM algorithm. Data preparation. Finding anomalies in raw data, cleaning noise data. Classification. Types of input data. Class types. Use areas. Formal task. Classification algorithms. Nearest neighbor's method. Bayes classifier. Trees of solutions. Classification. The task of clustering. Types of input data. Objectives of clustering. Responsibilities of distance. Formal task. Clustering algorithms. The method is ksmart. medium method. Genetic algorithm. Clustering. The challenge is to find associated rules. Formal task. Concepts. The process of establishing the associated rules. Algorithms of searching for associated rules. Searching for associated rules. Upproximation. Target setting. The least square method. Linear pproximation. Logarifmic pproximation. Exponential pproximation. Step-upproximation. Interpolation. Target setting. Lock and global interpolation. Lagrange's interpolation multi-member. Newton's Interpolation Match. Extrapolation. Time series. Time series components. Integration of the components of the interim series. Trend assessment. Functional relationships. Trend. Sliding average method. Exponential smoothing method. Projections. Double exponential smoothing. Holt Winters method. Quality of forecasting. Approximation, interpolation and extrapolation. Time series: trend, seasonality, noise. Projections. Upproximation. Target setting. The least square method. Linear pproximation. Logarifmic pproximation. Exponential pproximation. Step-upproximation. Interpolation. Target setting. Lock and global interpolation. Lagrange's interpolation multi-member. Newton's Interpolation Match. Extrapolation. Time series. Time series components. Integration of the components of the interim series. Trend assessment. Functional relationships. Trend. Sliding average method. Exponential smoothing method. Projections. Double exponential smoothing. Holt Winters method. Quality of forecasting. Correlation analysis. Regression and regression analysis. Linear regression. Nonlinear regression. Regression analysis. What's a neural network? Chronology. HC classification. Steps to meet the challenge. Scope of HC. Neural structure. Sinaps. Principles of work of the HC. Activation function. Training, validation, testing. Iteration. Epoha. Wrong. Neuron of displacement. HC training. Gradiant launch. Reverse dissemination method (IDM). Hyperparameters. Comity. Retraining. Neural networks. Overtime neural networks (SNA). SNA architecture. A layer of cricket. Activation layer. Puling or sub-discrete layer. Half-time HC. SNA training. SNA benefits. SNA shortcomings. Overtime neural networks. Digital Signal Processors (CAPs). GPU. Programmed logical integration schemes (PPIS). CUDA. Systems on crystal (SoC). Mathematical and scientific calculations: MATLAB, Python, R.",
    "The course is devoted to the automatic processing and analysis of video and images in intellectual video computer medical systems. The focus is on the digitalization techniques and algorithms of medical images and video data, video analysis techniques, machine training and data analysis to address detection, segmentation, classification of objects of interest. In-depth learning methods, as well as smart-technologies for visualization and video imagery are being studied (storing panorama images, visualizing images in narrow spectral ranges, synthesis of images, taking into account the personal characteristics of users, etc.). The course examines the structure and principles of the actual medical video computer systems, as well as the features of video-data processing. The purpose of the discipline is to examine the principles, methods of processing and analysis of medical images and to develop the skills and capabilities of the medical video analysis. A full range of advanced computer-based technologies in the subject area is being studied: improving visual quality and the prognostic value of medical images, providing non-visual information (analysis) of medical videos. The objectives of the course include: Study of the digital processing of medical images and data analysis, acquisition of knowledge in the area of machine learning. Creating skills and skills to address video analysis in medical video systems. Development of computer-based algorithm skills tailored to health data. Knowledge of the digital processing of medical videos in order to improve their visual and ergonomic quality; the basis of intelligence analysis for the segmentation and classification of objects of interest in medical images; the possibilities of modern tools and programming systems to address the challenges of machine learning; knowledge of the foundations of smart visualization techniques to shape images with new properties; principles of computer-based systems, methods and approaches to project design and implementation Sensitizing to undertake comparative analysis and selecting tools to address the challenges of skill training; directing projects to build, implement and support artificial intelligence systems based on a cross-cutting digital subtechnology called &quot; Computer vision &quot; , taking into account the specificity of video-computer medical systems and the characteristics of medical video data. In the course of the study, learners are trained to work with specialized packages and software libraries to design, model and study computer techniques and algorithms for medical video computer systems. Questions to Colloquium 1. 1. How do you form an inter-catalysis drug? 2. List the main ways of obtaining contour. 3. Explore the principle of combining images in accordance with Operation I? 4. Explain the fundamental dignity of the algorithm of the segmentation of objects on the basis of motion energy. 5. Explain the main restrictions on the segmentation algorithm based on motion energy. 6. Determine the motion vectors. 7. Based on what assumption is the basic equation for optical flow? 8. List the main limitations of the optical flow equation. 9. What kind of techniques do you know? 10. Example the correlation method. Colloquium 2. 1. Formulate the fundamental difference between teaching methods and teachers from teaching methods without teachers. 2. Give me a definition of the comrades. What do you mean, a combination of objects? 3. Explain what are the elements of the Mahalanobis reference matrix in the classification method? 4. Comment on the distance of Mahalanobis. 5. Explain how the distance of Mahalanobis and the distance of Euclid are connected. 6. Explain how teaching methods differ with the teacher and without the teacher? 7. Please indicate what is the result of the task of clustering? 8. Explain why it is important to identify a set of grounds for clustering? 9. Open the principle of k-medium algorithm. 10. Indicate and comment on the shortcomings of the k-medium algorithm. Colloquium 3 1. List the main stages of a panoramic image. 2. What points on the image are characteristic or key? 3. Explain the principle of Harris' coal detector work? 4. Give me a definition of a forward-looking image transformation? 5. What is the RANSAC algorithm for? Ministry of Science and Higher Education of the Russian Federation, FGAO, St. Petersburg State Electrical University, LETHI, V.I. Ullianova (Lenin) EQUMENTATION BILLET No. 1 Discipline Methods for processing and analysing medical images 1. Method of reference vectors in machine learning in medical video systems. 2. Principles for panoramic images. Chief of the N.A. Obuchov Department. General characteristic of medical intelligent video systems, methods of handling, analysing and visualizing video data in them. 1.1. Different types of cameras, objects, computers and their parameters. Interrelationship of the image quality and basic parameters of the camera (enhancement, extraction, focus distance, diaphragm, frequency of personnel). 1.2. Classification of medical video systems: by level of human participation, by nature of the tasks to be performed, by means of hardware. 1.3. Intelligent medical video system. Areas of application, tasks and types. Special features of the processing, analysis and visualization of video data. Imaging in medical intelligent video systems. Personnel. 2.1. Imaging machine in the medical video system. Basic principles of construction. Criteria for assessing the quality of images shaped. 2.2 Modern methods of noise suppression. State of the art: NLM, BM3D, neuronet. 2.3. Contemporary methods of brilliance and contrast. Level &quot;State of the art &quot;: Multi Scale Image Contrast, Adaptive and Integrated Neighborhood Depend-ent Approach for Nonlinear Enhancement (AINDANE), Locally Tuned Nonlinear Technique for Color Image Enhancement, Multi Scale Retinex. 2.4. Colorimetery and colored spaces. Methods of conversion of colour spaces. Cement correction. Colour calibration. Methods of analysis of video data in medical intelligent video systems. 3.1. The rationale. (Specific optimization tasks. Scale and vector optimization. Target function and its properties. Preliminary study of the task force. Methods of finding a minimum of one-time function. Methods of finding the minimum function of many variables. An indication of the object and an indication of space. Purposes of classification and regression. 3.2. Regression models. The reservoir method. The forest of the decisive trees. 3.3 Clustering. The algorithms k are medium and medium. Quality assessment of clustering. Clustering process. Application of cluster analysis. 3.5. Non-region networks and in-depth training in medical video systems. Methods of visualization in medical intelligent video systems. 4.1. 4.2. Three-dimensional images. 4.3. Visualization of hyperspectral and narrowband images. Examples of algorithms for the analysis and processing of video-data produced in medical intelligent video systems of various types of use. 5.1 Examples of decisions in medical video computer systems. General issues and specificities of medical data. 5.2. Examples of solutions in hyperspectral video computer systems. General issues and specificities of hyperspectral data. 5.3. Examples of decisions in video-computer technology systems.",
    "Autonomy systems that are subject to this discipline are mobile robots that are responsible for service tasks. Engineers who develop these robots provide an interface for low-level system management, so the non-standard trajectory programming is on the user. This discipline examines the ways in which the physiological trajectory of the movement, the characteristics of the control of autonomous systems, and the principles of simulators. To develop the knowledge, skills and skills of trainees to apply the management algorithms of autonomous systems in a sound and effective manner. To teach the application of existing management theory algorithms, as well as the development of new methods and management algorithms of autonomous systems. Provide knowledge of existing techniques and management algorithms of autonomous systems. To enable the development of self-contained systems management algorithms and to use computer-based methods to manage autonomous systems. Instil skills in the development and analysis of the management of autonomous systems. The IDH is a simulator, as well as an analytical calculation of the traffic trajectory. The challenge in the IDZ is to build a trajectory of traffic based on the desired data from the beginning of the trajectory and the end. The evaluation of IDH is carried out in an integrated manner, and the results are based on a four-balanced scale, which subsequently affects the admission to the examination. The evaluation criteria are given in section 6.4 of the current control methodology. Ministry of Science and Higher Education of the Russian Federation, FGAO, St. Petersburg State Electrical University, LETHI, V.I. Ullianova (Lenin) EQUALATION BILLET No. 1 Discipline of the Autonomous System Management Theory 1. Blue traffic. Examples, characteristics, how to achieve trajectory by differential equation 2. BIT regulator. Limits of applicability. Chief C.V. Krinkin. Introduction. Problems and challenges in the management of autonomous systems. Linear and non-linear autonomous systems. Simple examples of linear system management. Topic 1. Basic laws on the movement of the body. Steps to free robot movement. Turning and shifting. Exponential rotational coordinates. Uniform transformation matrices, exponential solid body movement coordinates. Topic 2. Direct and reverse cinema. Speed cinema using spatial cocobiana and body Jacobine, open chain static, features and manipulation. Analytical and numerical reverse cinema. Topic 3. Traffic controllers. PID regulator, adaptive regulator. A little regulator. Dignity, shortcomings and scope. Topic 4. Lapunov's function. Lyapun's function as a tool for solving differential equations. Use of Läpunov &apos; s physiological trajectory for linear systems. The advantages and disadvantages of governance through the Lapun function. Topic 5. Robot control systems. Traffic planning on the discontinuous C-space grid. Planning tools based on random sample. Virtual potential fields and non-linear optimization. Systems with feedback. Conclusion. Potential for analytical and numerical management. Speculation and interpolation of trajectories.",
    "Discipline describes the basic concepts of system analysis, the principles of a systemic approach (finality of purpose, unity, modularity of construction, hierarchy, functionality, development, decentralization, uncertainty), the basic methods of system modelling, machine experiment planning techniques, modelling languages and system optimization. To study the basic concepts of systemic analysis, the principles of a systemic approach (finality, unity, modularity, hierarchy, functionality, development, decentralization, uncertainty) Main systems modelling techniques, machine experiment planning techniques, modelling languages and system optimization. Study of basic logical methods and techniques of scientific research and methodological theory and principles of modern science. Knowledge of the methodology for constructing complex systems and methods of optimization and decision-making. Develop a methodological basis for scientific research. Sensitizing to develop a methodology for the construction of complex systems models and to apply optimization and project decision-making techniques. Development of systems analysis techniques and acquisition of simulation and optimization skills in the design of automated systems. IDH is an analytical search for the necessary information to meet the challenge, address and detail the decision. The sources of information are lectures, basic and additional literature, Internet sources. The IDH reports are prepared in accordance with the requirements of the laboratory work report set out on the LETI SPGET website under the student work template. At least 5 pages of format A4 are reported electronically. Example IDZ topics: Make the classification of dynamic system models from the size of the structure and type of time assignment (continuous, discrete). Bring analytical models to determine the probability of the Continuing Markov chains. Bring the analytical pattern of the palm retour flux and remove the density of the rectum of the estates in the simple flow. Formulate the basic properties of the simple flow and give expressions to the Poisson flux. Ongoing performance monitoring tests are based on the selection of one or more correct answers. An example of the test is given below. 1. The system is called complex if: the number of parameters exceeds 5 structure of the system contains feedback and cross-referencing of the linear and cross-referencing structure of the system has a decisive influence on the system &apos; s response. EQUMENTATION BILLET No. 1 Disciplinary analysis, modelling and optimization of systems 1. Principles of a systemic approach: limbs of purpose, unity, modularity of construction, hierarchy, functionality, development, decentralization, uncertainty 2. The notion of the Petri networks and the characteristics of the models based on them. Chief C.V. Krinkin. Introduction. Place of discipline in the PLO. Types of monitoring and evaluation. Topic 1. System studies as part of the general system theory. Description of systems. Types and structures of systems. Concepts of system decomposition and hierarchy. Targeted systems. Global and local goals. Main properties of systems: stationaryness, continuity, discontinuity, determinacy, waste. Management, observation, reproduction. Modular system design. Topic 2. System objects and their summary. Principles of a systemic approach: limbs of purpose, unity, modularity of construction, hierarchy, functionality, development, decentralization, uncertainty. Main stages of systemic research. Mechanism of the system design process. System design. Topic 3. Main functions of models and their classification. Modelling as a method of scientific knowledge. The role of Russian scientists in the development and development of mathematical modelling. Characteristic of system modelling issues. Main functions and approaches to model descriptions. Mathematical model. Analytical and imitational, statistical and dynamic, continuous discrete, determinative and dental models. Models. Topic 4. Models and machine modelling techniques. Basic methods of model research. Sensitivity analysis, model identification. Methods for assessing the adequacy and accuracy of models. System modelling sequences and machines. Conceptualization and formalization of the system. Algorithmization and implementation of the model. Receipt, interpretation and documentation of modelling results. Topic 5. Formalization of system descriptions and analytical models of mass service systems. Automatic and graphic models. The notion of the Petri networks and the characteristics of the models based on them. Stock networks. Aggregate models. Requisition flows. Markow models (simple, single and multi-channel with turns). Methods of approximation of mass service systems. Topic 6. Simulation models. Organization of statistical modelling. Methods of continuous and temporal management in simulation models. Image in simulation models. Characteristic of statistical modelling. Numbers and machine-generation procedures. Quality check of pseudence sequence. Methods of generating accidental impacts are values, sequences, processes, flows and fields. Specificities of statistical processing of model results. Topic 7. Systems simulation tools. Systems modelling and programming languages. Comparative analysis of simulation languages. Examples of modelling languages. Modelling packages. Automation of experimental and computing planning processes. Plan generators. Automated collection, data collection and processing. Topic 8. Engine experiment planning. Main concepts of engineering experiment planning. Dispersion and factor experiments. Full Factory Experiment and Drift Replications. Orthogonal plans. Strategic and tactical experimental planning in simulations. Methods of reducing costs in simulations. Theme 9. Installation of system optimization, key multi-criteria optimization techniques. Acceptable, strictly acceptable and optimal systems. Equation of optimization. Optimization: parametric, structural, functional. Multi-criterial optimization methods: a common criterion method (additional and multiplier criteria), a critical matrix method, a hierarchy analysis method. Examples of structural and parametric optimization of information and computer systems. Conclusion. Main areas of development of systems analysis, modelling and optimization.",
    "This course introduces listeners to the basics of driving drones. The main components of such systics are: sensor- or man-machine interface information models and techniques; self-identification methods for a well-known and unknown map; route planning techniques (including graphs and not graphs); a fluorc suitable for developing its own solutions for unmanned vehicles. The course introduces the levels of autonomy of unmanned equipment, the basics of machine training, including neuronets, the Robot Operating System, a de facto standard solution for many robots, including bleached vehicles. The course provides basic ROS programming techniques, localization and mapping algorithms (SLAM), machine algorithms. Develop the knowledge, skills and skills of trainees to apply existing methods, models and algorithms to the management of unmanned vehicles and other autonomous intellectual systems. Train the use of existing techniques and models for unmanned transport. Provide knowledge of existing methods and algorithms of unmanned transport, as well as the methodology for unmanned transport systems. To enable the development of algorithms for unmanned transport and to use computer and machine-learning techniques to meet the challenges of unmanned transport. Provide skills for the development and analysis of Autonomous Movement algorithms, observation of the world &apos; s surroundings, data filtering. IDH is an analytical search for the necessary information to meet the challenge, address and detail the decision. The sources of information are lectures, basic and additional literature, Internet sources. The assignment to IDE is made at the beginning of the semester. The IDH reports are prepared in accordance with the requirements of the laboratory work report set out on the LETI SPGET website under the student work template. At least 5 pages of format A4 are reported electronically. Example IDZ topics: develop an application based on ROS, process laser dilator data, develop or modify SLAM algorithms to address the challenge of simultaneous localization and map development or modification of the semantic segmentation algorithm of images with neurosate development of the algorithm of the unmanned vehicle. EQUMENTATION BILLET No. 1 Discipline of the free transport unit 1. Location on a known map. Data structures to store the map. 2. Scan matcher based on a stash search. Dignity, flaws and scope of application by the Café Manager. General information on autonomous and intellectual systems. Unmanned cars. Challenges to unmanned vehicles. Automation levels for unmanned vehicles. Ducks and sensors. The glass of algorithms performed by unmanned vehicles. Introduction to Robot Operating System. ROS appointment. ROS in unmanned vehicles. Programme unit in ROS. Methods of interaction between programme units. Elaborate your own ROS application. ROS programming. Preparation of CMake files, xml files with parameters. Starting ready applications. Compilation and collection of ROS applications. Work catalogue structure. Design, launch and logging of their own applications. Use of ROS packages. Visualization of the ROS programme module interface. Design and use ROS packages to facilitate development. Designation and application of the TF package. Use of sgenerated reference code. Tools for visualization and retrieval of ROS applications. RVIZ package, rqt family, Rqt_graph package, Gazebo package. Setting up log files. ROS equipment. Multi-point ROS. Introduction to engineering. Teacher training. Classification and regression. No teacher training. Clustering. Neural networks. The notion of neuron, perceptron and the simple neural network. The elephants in neural networks. Application of neural networks. Non-earmarked direct distribution networks. Perceptor. Halfway networks. Hopfield's neural network. Straight neural networks. The nurturing neural networks. Classification and clustering of images with neural networks. I don't want Kohonen. Network operation. Contemporary modifications of silicon neuronets for clustering. Not enough. Acceleration of work. Synthetic data for training. Data filtering. Filter target set. Recurring filter. Model. Complexation. A priori and aposterior assessment. Calman's extended filter. Matrilineal engineering. Culman's old-fashioned movie. The challenge of simultaneous localization and mapping of SLAM. SLAM challenge. Calman filter solution. Particulate filter. FastSLAM. Gmappnig. Scan matching. County approaches. Methods for measuring SLAM algorithm quality. Applying SLAM to the task of drones. Methods of presentation and storage of maps. A map to EKF SLAM. Employment grid. Details of the SLAM graphic algorithms. Definition and setting of cycles in the box. Methods of visualizing the map in ROS. Methods for evaluating the quality of the map. The challenge of building a path. The challenge is to find a way on the count. Daxtra's algorithm. Ah. Methods to build a road to an unknown map. Local road planner. PID regulator. A global and local planner. Duckietown as a model of a city with drones. Duckietown. Description of the parts. Robot Duckiebot. Robot components. Ducketown. Duckietown as a model for unmanned transport. Automation of traffic along the route in the Duckietown simulator. Duckiebot. Application of SLAM algorithms to Duckietown. Construction of the Duckietown route. Simulator Duckitown. Launch all components of a drone in a simulator. Conclusion. Discussion on the status of the vehicle applications for the coming years.",
    "The contents of the discipline include: basic models for the presentation of knowledge and methods of processing: a logical model, a product model, a framing, semantic networks; a framework for the organization, construction and use of expert systems; methods of finding solutions in the area of the environment; and methods of planning actions in artificial intelligence systems. The Laboratory Workshop focuses on the study of methods for the presentation of knowledge and the decommissioning of fluorescent systems, the development of methods for managing the findings in expert systems, the development of a product-based expert system, the exploration and implementation of spatial surveys, and the planning of actions in artificial intelligence systems. Study of basic models for the presentation of knowledge and methods of processing, the foundation of the organization, the construction and use of expert systems, methods for finding solutions in the environment, methods for planning action in artificial intelligence systems. Development of methods for managing the findings in expert systems, development of an expert system based on product knowledge, research and development in the field, and action planning models in artificial intelligence systems. Study of models for the provision of knowledge, theory, methods and means of building artificial intelligence systems based on the knowledge of world trends in computer technology and information technology development. Sensitivity is guided by the product programming paradigm. Acquisition of product programming practices. Acquisition of skills for the formalization of intellectual tasks through artificial intelligence languages. The student should show the ability to analyse professional information, to focus on it, to structure and inform. Development of knowledge management techniques, methods of intellectual planning, research techniques. An individual homework is given to a student in the 10th week of the semester. The student should analyse lecture materials, basic and additional literature, Internet sources, develop an expanded task and agree with the teacher. The IDH report should contain a task setting, an analytical review, a description of the task and a description of the result. The report is implemented electronically. Examples of topics for individual household assignments (ILS) Development of a CLIPS decision support system (substantive area specified in agreement with the teacher). Comparative analysis of intellectual agent architecture and trends. Models and methods for building real-time intellectual agents. Comparative analysis of tools for the development of intellectual systems. Comparison of learning methods for intellectual agents... No. 1 Theme: Presentation of knowledge and management of Conclusion 1. Formulate the principle of &quot; Okkama &quot; The preferred hypothesis is the simplest hypothesis, consistent with the data. 2. What's the real deal with retrieving? Actions that reach at least one of Goal 3. What is the logic of second order predictors different from the logic of first order predictors? The logic that deals only with the expressions of objects, properties and relationships of the subject area is called the logic of the first order. If comments are considered, we are dealing with the logic of the second order, etc. Examination tests are based on questioning options for choosing one or more correct answers. An example of the test is given below. An empty sequence of the symbols displayed may be of: (1) symbol type, (2) string type, (3) type of &quot; name &quot; . Introduction. The subject of discipline, its enmity, the content and connection with other disciples of the curriculum. Course literature review. Evolution of artificial intelligence systems. Programme environment for the development of EC CLIPS. Expert system (EC). Main features, architecture and EC classification. Development and life cycle phases of the EC. Programme environment for the development of EC CLIPS. Appointment and basic possibilities. Basic data types and CLIPS reporting. Presentation and processing of CLIPS products. MLV reference cycle. Syntaxis of antennas of rules, types of conditional elements. A logical conclusion in CLIPS. Conflict resolution strategies. Knowledge and withdrawal management. Knowledge models. Syntaxis and semantics of the first order logic. Logical pursuit. Logic conclusion. The method of resolutions is in the logic of first order predictions. Product systems. Management of output systems. Conflict resolution. Frames, like a model of knowledge. Management of the decommissioning system. Semantic networks. Semantic net withdrawal. Methods of finding solutions in the realm. Search space. Formal searching. An algorithm of search. Upstairs of the tree and the state of the quest. Climb operations. Addressing the challenge of planning action in artificial intelligence systems. Planning. Language of description of the state of affairs and actions. Prospect-based planning. Planning with proposition logic. Planning action in the real world. Conclusion. Outlook for the development of artificial intelligence systems as an information technology innovation area",
    "The purpose of the discipline is to develop students &apos; professional knowledge and skills in the organization and management of information technology advisory projects. The purpose of the discipline is to provide students with professional knowledge and skills in the organization and management of information technology advisory projects. Challenges of discipline: (1). Knowledge of the life cycle features of the consultancy project, consultancy and IT management standards, IT auditing techniques and enterprise IT strategy development, and how IT services are organized in enterprises (2). Involve the skills and skills to carry out the feasibility study of IT investments, develop the enterprise &apos; s IT strategy, develop recommendations to improve enterprise IT architecture, develop IT infrastructure policies, develop IT infrastructure requirements, develop information system requirements, justify product solutions and develop technical assignments for implementation (3). Availability of business process analysis and requirements, consultancy and service costing skills. Knowledge of the characteristics of the life cycle of the consultancy project, consultancy and IT management standards, IT auditing techniques and enterprise IT strategy development, and how IT services are organized in enterprises. To be able to carry out a feasibility study on the effectiveness of IT investments, develop an enterprise &apos; s IT strategy, develop recommendations for improving the enterprise &apos; s IT architecture, develop IT infrastructure policies, develop information system requirements, justify product solutions and develop technical implementation tasks. Business process analysis and requirements, consultancy and service cost-sharing skills. Introduction. The notion of IT consulting and information technology consultancy projects. Consulting and IT Consulting. An understandable consulting machine. Consulting classifications. Synthetic model of classification of consultancy services. Requirement of consultant profession. External and internal consultants. Reasons for consultants by organizations. Professional counselling. Memorial consultant. A man and a consultant's profession. The basic components of the consultant &apos; s profession. Professional standards of the consultant. Consulate general knowledge. The consultant's code of professional conduct. Consultant role model. Consultancy model. Consultant business. Consul's communications with the client. Interviewing, managing the presentation of the Consulting product. Specificities of internal and external IT consulting. Harmonization and typification of IT-consalting solutions. Human factor in IT consulting. Identification of key steakhol. Project phase and IT Consulting Unified Program. Consulting project proposals. Content and components of the design phase of the consultation. Customer business. Memorial for the client. Components of a reimbursable consultancy contract. Annex to the treaty. Project stage IT-process models in the organization. Classification of work lines in the IT Consulting area and the most needed services. IT strategy model. The IT infrastructure model in the organization. Information security model. Main principles of social work and IT consulting. Target planning. Fund planning. Resource planning. Implementation of project plans and monitoring. Implementation criteria. Quality assurance. Assessment of changes in project implementation. Principles for establishing and implementing information systems at IT Consulting. Challenges and opportunities in designing information systems for management. IT Consulting as part of management consulting. Consulting is a structural element of the economy. Consulting market. IT Consulting with a general consultancy structure. Trends in the development of the consulting market in the world and Russia. Steps in the consultation process. Pre-project stage (client contact, commercial proposal, contractual arrangements). Project phase (diagnosis, decision development, implementation). Post-project phase (effect and deviation analysis, self-analysis, adjustment and service). Consulting standards. IT audit and strategic IT consulting. ITAF Methodology Assessment of the state and maturity of IT management processes. COBIT standard. Elaboration of an IT strategy and concept of enterprise information technology development. Ensuring that IT systems meet business requirements. Identification of key parameters for the implementation of IT projects (objectives, tasks, boundaries, priority of work, time frames, cost, risks). Development of IT architecture. Develop a targeted architecture of annexes, data, integration, infrastructure solutions. IT investment management. Feasibility study on IT investments. Estimate of total IT ownership. Operational IT Consulting. Organization of IT services. Library ITIL. Developing business process models and regulations. Business process reinženiring. Policy on the development and operation of IT infrastructure components. Official instructions. Product IT Consulting. Information system functionality requirements. Selection and rationalization of a product solution. Technical assignment for the introduction of the software product. Managing implementation through the establishment of joint working groups. Organization of a knowledge system. Test method. Managing the introduction of the information system into industrial use and developing its regulations. Monitoring the implementation of the information system and making the necessary modifications. Conclusion. Evaluation of the results of the consultation. Guidance. Effectiveness and quality of counselling. Brief description of business services. Results of pilot studies of the consultancy market.",
    "Discipline is focused on the basic principles of distribution systems. The theoretical part of the course deals with the interaction and synchronization of processes, consistency of replicable data, and non-sustainability in distributed systems. In the course of discipline, practical skills are being developed for the development of distributed applications in the objective-oriented language of Java programming, using different processes interaction models. The purpose of the discipline is to examine the principles of distribution systems and to develop practical skills in the development of distributed applications using different processes. To obtain theoretical knowledge in the field of interaction and synchronization of processes, to achieve consistency in replicable data and to ensure non-sustainability in distributed systems. Develop practical skills to develop distributed applications in the objective-oriented language of Java programming. Enabling approaches to building the architecture of the distributed annex. Knowledge of the principles for the construction of distributed systems; methods and tools of artificial intelligence systems, their selection criteria and methods of integration; basic criteria for the efficiency and quality of the artificial intelligence system; methods, languages and software for the development of software components of artificial intelligence systems. Skills to develop distributed applications; select, apply and integrate the methods and tools of artificial intelligence systems, their selection criteria and methods of integration; select, adapt, develop and integrate the software components of artificial intelligence systems, taking into account the basic performance and quality criteria. The use of an integrated development environment in the process of establishing distributed annexes. Introduction. Subject of discipline and its tasks. Historical background on the development of distributed systems. The importance of this direction for artificial intelligence. Discipline structure. Characteristic of literary sources. Process interaction models in distributed systems. Flows and processes. Process interface models - remote handling of methods, query systems. Examples of the use of remote treatment in practice. Types of processes in distributed systems. Internal process organization. Multi-point technologies. The client-server model and her organization. Modalities for the migration of programmes and processes from car to vehicle. Means of using names in distributed systems. Name and essence. Organization of access to the essence. Name areas. Permission of a name. Implementation of the name system. Name serves. Examples of existing validation of domains of names. Mobile creatures. Approaches to their localization. Name organization. Interaction with the nature of names and localization. Automatic disposal mechanisms. Synchronizing processes in distributed systems. Real-time Synchronization. Synchronization with one relative heating parameter. Determination of the distributed global state and its recording in synchronization. Voting algorithms. Distributed mutual exemptions. Distributed transactions, their classification and implementation. Replicable data in distributed systems. Replication of data. Replicable objects. Consistency of replicable data. Ways of achieving consistency in data in distributed systems. Data consistency models in distributed systems with shared memory. Reliance on consistency models - dissemination of updates and maintenance of consistency of resplic. Conclusion. Main areas for further development and practical use of distributed systems and technologies in artificial intelligence.",
    "At the dawn of robotics, every robot developer had to develop his own library to manage the robot. There are many libraries in the modern world that facilitate this process. There are libraries and franchises focused on common robotics. In addition, there are libraries with a narrower purpose, such as the effective transfer of information from knot to node. As part of this course, participants will meet some of the popular libraries for the development of mobile robot software. Development of practical aspects and experience in the development infrastructure for mobile robots. Acquisition of students and retention of practical skills in a research group that carries out applied research in a specific field, including the setting of a task, the choice of tools and methods for its implementation, the computerization of these methods and the meaningful interpretation of the results. Provide knowledge of existing methodologies, libraries and approaches for the development of mobile robot software. Develop skills to decompose mobile robot management, identify the most appropriate data tools and architectures for each individual task, develop software for mobile robot management. To develop skills with popular methods, approaches and libraries in mobile robot management infrastructure. Ongoing control involves two colloquiums during the semester. Examples of questions for colloquiums: Existing approaches for mobile robot programming. Architecture publishersubscriber. Freamwork to exchange messages. Different DDS decisions. RTI Connext DDS, OpenSplice, ROS, ROS2. Relationship of high-level and low-level programming. Methods of robot emulation. Areas of application of ROS. ROS possibilities. Indicative examples of ROS packages developed. Turtle_bot, Turtle_sim. Implemented modules (Node). Topic. Count connecting Node and Topic. Expand the model for the variable number of nodes while maintaining the realtime properties. &quot; Unstandard &quot; Turtle_bot &quot; , using the Topic messages. Restriction of the exchange buffer. Use of standard types of messages. Implementing their own types of communications. Broad messages. Communications implying a response. Blocking and unlocking messages to ROS. RQT_Graph as a way to demonstrate the current state of the system. Rviz as a way of visualizing. EQUMENTATION BILLET No. 1 Discipline of the Mobile robot software infrastructure 1. Blocking and unlocking messages to ROS. RQT_Graph 2. Work in real time. Introduction. Existing approaches for mobile robot programming. Architecture publisher-subscriber. Topic 1. Distribution data services (DDS). Freamwork to exchange messages. Different DDS decisions. RTI Connext DDS, OpenSplice, ROS, ROS2. Topic 2. Introduction to ROS. Relationship of high-level and low-level programming. Methods of robot emulation. Areas of application of ROS. ROS possibilities. Indicative examples of ROS packages developed. Turtle_bot, Turtle_sim. Implemented modules (Node). Topic. Count connecting Node and Topic. Expand the model for the variable number of nodes while maintaining the real-time properties. Insufficient Turtle_bot with console. Topic 3. Exchange of messages to ROS. Types of messages in Topic. Restriction of the exchange buffer. Use of standard types of messages. Implementing their own types of communications. Broad messages. Communications implying a response. Blocking and unlocking messages to ROS. RQT_Graph as a way to demonstrate the current state of the system. Rviz as a way of visualizing. Topic 4. Special features of ROS implementation. Launch file, base code structure. Methods of reusing the code to ROS. ROS packages. Teams for their creation and assembly. Topic 5. Establishment of exchange protocols for robotics nodes. Service from the program and the console. Communications through Topic and through Service. Implementing your own type of service messages. Handling the answer to Service. Simultaneous application of information transmission through Topic and Service. Topic 6. Installed ROS packages that facilitate the development of mobile robots. TF. Gazebo. RVIZ. Navigation_stack. exploration_stack. Topic 7. RTI Connext DDS. Master is a decision-making process from RTI. Writers and readers. Setting parameters for transmission. Work in real time. Theme 8. Open Splice. The Master is in the Open Splice decision. Writers and readers. Setting parameters for transmission. Real-time work",
    "The discipline objectives cover a number of areas related to testing planning, product and project risk identification, testing and exit criteria, incident management, testing, testing techniques, testing, testing, final testing reports. The purpose of the training course is to improve the logical testing and programme design, as well as the application of the skills acquired in testing and refining programmes, to develop professional competencies for students in the use of theoretical knowledge and practical skills in software quality. Challenges of discipline: (1). Study of major processes and types of testing, modelling of software development, accompanying processes, learning about how to manage the escort process, how to manage the work in the implementation of the PA escort tasks. Formulation of methods to plan testing, identify product and project risks, establish criteria for entry into testing and exit, manage incidents, develop tests, select test methods, test results, produce final test reports, formulate requirements for PA escorts, use international and domestic standards for accompanying EOs, use regulatory legal instruments accompanied by P. 3). Testing skills (equivalent split, border analysis, test of the decision table, testing of the transition table, testing of the use scenarios), integrated development environment and various testing and planning tools. Knowledge: - Basic methods and tools for effective analysis of software performance; - Main types of software maintenance work; - Basic principles for the control of configuration and support for software integrity; - software protection tools in computer systems. Smartness: - select and develop software configurations for computer systems; - use computer system software techniques; - install computer systems software; - develop individual computer software components; - analyse the risks and quality characteristics of software. Skills: - construction of selected components of computer systems software; - implementation of selected types of work during the software support phase. Introduction. Life-cycle testing site. Basic concepts of discipline. The role of testing in software development, software maintenance and operation. Testing planning and management. Test analysis and design. Nature of escort. Need for escort. Priority of escort costs. escorts. Testing in the HC model. Levels and types of testing. Alpha testing, beta testing, component testing. Iterative testing. System testing. Applicable testing. Black box test, code coating, functional testing, interaction testing, load testing, recovery testing, productivity testing. Portability testing, reliability testing, safety testing, stress testing, structural testing, usability testing, white box testing. Impact analysis, escort testing. Formal and informal review. Entry criteria, inspection, metrology, moderator, equivalence, expert, secretary, technical analysis, cross-checking. Actions (steps) of formal review. Roley and duty. Types of reviews. Success factors. Compiler, complexity factor, management flow, data flow, statistical analysis. IEEE 1028] IEEE Std 1028 (2008) IEEE Standard for Software Reviews and Audits. Test design methods. Life cycle of defect. Types of defects in different phases of testing. Defect management. Bug-Tracking systems. Test-Cays. Specification of test scenarios, testing design, testing schedule, testing procedure specifications, automated test scenario, traction. Develop black box tests, develop white box tests, test method based on experience, specification method, structural method of testing. Analysis of border values, testing of the decision table. Equivalent breakage, testing of transition tables, testing of use scenarios. Cover code, cover alternatives, cover of operators, structure-based testing. Research testing, assault (deficit). Selection of test methods. Testing management. A technician, a test manager, a test manager. Organization and independence of testing. Testing approach, testing strategy. Testing planning. Configuration management. Theory management. Product risk, project risk-oriented testing. Tool, coating instrument, dynamic analysis tool, incident management tool, load test tool, simulation tool, tool for monitoring, performance testing, sensing, demand management tool, reassessment tool, tool for protection, statistical analysis tool, stress test tool, test companion, test tool, test tool, test tool, test tool, test tool, testing tool, testing tool, testing toolkit, testing toolkit, testing tool, integrated testing toolkit. Key software escort issues. Technical questions. Management questions. Cost of escort. Simulations accompanied by software. escorts. An escort. The escorts. Reinjing. Reverse engineering. Introduction to ITIL. What is ITIL, other existing methodologies. IT Service Management. Life cycle service. Roll model, Roli's concept. RACI model. Service strategy and service design. Service management value. Concepts and definitions. Formulation of a strategy. Risk assessment. Financial management. Demand management. Principle 4R. Five parts of service design. Service management. Catalogue management. Power management. Access control. Continuity management. Information security management. Supplier management. Service conversion and maintenance. Balance. Incident management. Management of events. Request management. Problem management. Access control. Functions. Service Desk. Service Desk: Role. Service Desk: Organizational structure. Service Desk: Building criteria. Service Desk: Possible implementation problems. Service Desk: Metriki. Technical management. IT operations management. Application management. Ongoing improvement of services. Conclusion. CSI targets. The role of continuous improvement of services. PDCA model. Mets. 7th step-by-step service improvement process. Development of testing and escort tasks.",
    "In the course of study, students acquire the skills to manage industrial software development on the team, including the management of software requirements, the use of project management methodology and the tracking of Agile errors, and the management of versions and repository. In accordance with the Agile methodology, iterative development is performed. Knowledge of key software design processes, programme project management issues, parallel process planning principles. To develop software design techniques, acquire knowledge of tools supporting software development. Knowledge of key software design processes, programme project management issues, parallel process planning principles. To develop software design techniques, acquire knowledge of tools supporting software development. Acquisition of software design skills, use of tools supporting software development. Introduction. Brief description of discipline, its objectives and objectives. Industrial software development methodologies. Possible options for developing a programme project. The notion and types of management decisions. Management decision-making. Management decision-making methods. Management strategies adopted in existing methodologies. Rigid and flexible software development methodologies from strategic concepts. Basic principles and concepts of SCRUM methodology. History (User Story), Tasks (Tasks), Spring (Sprint), Backlog (Backlog), Combustion Time (Sprint Burndown Chart), Roli SCRUM. Product owner (Product Owner), Skrum Master, Team (Team). Performance evaluation. Valuation of operations (Estimate Activity Durations), Evaluation of Operations Resources (Estimate Activity Resources), Work Package (Work Package) , Project Network chart (Project Schedule Diagram). Development of software interface. Version management systems, software technology. Conclusion. Other flexible development technologies, XP, Kanban, Lean Software Development."
]